#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]
#![allow(non_snake_case)]


use std::mem;

use libc::{c_void, c_char, c_uchar, c_short, c_ushort, c_int, c_uint, c_long, c_ulong};


// APACHE PORTABLE RUNTIME

pub const APR_RFC822_DATE_LEN:    apr_size_t = 30;

// run this hook first, before ANYTHING
pub const APR_HOOK_REALLY_FIRST:  c_int = -10;
// run this hook first
pub const APR_HOOK_FIRST:         c_int = 0;
// run this hook somewhere
pub const APR_HOOK_MIDDLE:        c_int = 10;
// run this hook after every other hook which is defined
pub const APR_HOOK_LAST:          c_int = 20;
// run this hook last, after EVERYTHING
pub const APR_HOOK_REALLY_LAST:   c_int = 30;

pub type sockaddr_in = c_void;
pub type sockaddr_in6 = c_void;
pub type sockaddr_storage = c_void;
pub type conn_state_t = c_void;

pub type apr_byte_t = c_uchar;
pub type apr_int16_t = c_short;
pub type apr_uint16_t = c_ushort;
pub type apr_int32_t = c_int;
pub type apr_uint32_t = c_uint;
pub type apr_int64_t = c_long;
pub type apr_uint64_t = c_ulong;
pub type apr_size_t = c_ulong;
pub type apr_ssize_t = c_long;
pub type apr_off_t = c_long;
pub type apr_socklen_t = c_uint;
pub type apr_ino_t = c_ulong;
pub type apr_uintptr_t = apr_uint64_t;
pub type apr_status_t = c_int;
pub type apr_signum_t = c_int;
pub type apr_read_type_e = c_uint;
pub type apr_bucket_is_metadata_t = c_uint;
pub type apr_filetype_e = c_uint;
pub type apr_uid_t = c_uint;
pub type apr_gid_t = c_uint;

   pub fn ap_hook_translate_name(     f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_map_to_storage(     f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_check_user_id(      f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_fixups(             f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_type_checker(       f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_access_checker(     f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_access_checker_ex(  f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_auth_checker(       f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_log_transaction(    f: Option<hook_handler_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_child_init(         f: Option<hook_child_init_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_open_logs(          f: Option<hook_open_logs_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);



   //todo:  this might have gotten messed up from the bindgen conversion of function args.  Look at the old param types
   pub fn ap_register_output_filter(name: *const c_char, filter_fn: ap_out_filter_func, init_fn: ap_init_filter_func, filter_type: ap_filter_type) -> *const ap_filter_rec_t;
   pub fn ap_register_input_filter(name: *const c_char, filter_fn: ap_in_filter_func, init_fn: ap_init_filter_func, filter_type: ap_filter_type) -> *const ap_filter_rec_t;

   pub fn ap_hook_insert_filter      (f: Option<hook_insert_output_filter_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);
   pub fn ap_hook_insert_error_filter(f: Option<hook_insert_output_filter_fn>, pre: *const *const c_char, succ: *const *const c_char, order: c_int);

   pub fn ap_add_output_filter(name: *const c_char, ctx: *const c_void, r: *mut request_rec, c: *mut conn_rec) -> *mut ap_filter_t;
   pub fn ap_remove_output_filter(f: *mut ap_filter_t);
   pub fn ap_add_input_filter(name: *const c_char, ctx: *const c_void, r: *mut request_rec, c: *mut conn_rec) -> *mut ap_filter_t;
   pub fn ap_pass_brigade(next: *mut ap_filter_t, bb: *mut apr_bucket_brigade) -> apr_status_t;
//(ap_filter_t *) ap_add_output_filter(const char *name, void *ctx,
//request_rec *r, conn_rec *c)
}

pub fn apr_table_elts_local(t: *const apr_table_t) -> *const apr_array_header_t {
   unsafe {
      ::std::mem::transmute(t)
   }
}

#[cfg(test)]
mod test {
   use super::*;

   #[test]
   fn bindgen_test_layout_apr_array_header_t() {
      assert_eq!(::std::mem::size_of::<apr_array_header_t>(), 32usize, concat!( "Size of: " , stringify ! ( apr_array_header_t ) ));
      assert_eq!(::std::mem::align_of::<apr_array_header_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_array_header_t ) ));
      assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).pool as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( pool ) ));
      assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).elt_size as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( elt_size ) ));
      assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).nelts as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( nelts ) ));
      assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).nalloc as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( nalloc ) ));
      assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).elts as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( elts ) ));
   }

   #[test]
   fn test_magic() {
      println!("MAGIC {}", MODULE_MAGIC_COOKIE);
   }
}
