#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]


use ffi;

pub const MODULE_MAGIC_COOKIE: ::libc::c_ulong = 0x41503234u64; /* "AP24" */
pub const MODULE_MAGIC_NUMBER_MAJOR: ::libc::c_int = 20120211;
pub const MODULE_MAGIC_NUMBER_MINOR: ::libc::c_int = 36;


/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}

impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self {
            storage,
            align: [],
        }
    }

    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];

        let bit_index = index % 8;
        let mask = 1 << bit_index;

        byte & mask == mask
    }

    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];

        let bit_index = index % 8;
        let mask = 1 << bit_index;


pub const APR_URI_LDAP_DEFAULT_PORT: u32 = 389;
pub const APR_URI_HTTPS_DEFAULT_PORT: u32 = 443;
pub const APR_URI_RTSP_DEFAULT_PORT: u32 = 554;
pub const APR_URI_SNEWS_DEFAULT_PORT: u32 = 563;
pub const APR_URI_ACAP_DEFAULT_PORT: u32 = 674;
pub const APR_URI_NFS_DEFAULT_PORT: u32 = 2049;
pub const APR_URI_TIP_DEFAULT_PORT: u32 = 3372;
pub const APR_URI_SIP_DEFAULT_PORT: u32 = 5060;
pub const APR_URI_UNP_OMITSITEPART: u32 = 1;
pub const APR_URI_UNP_OMITUSER: u32 = 2;
pub const APR_URI_UNP_OMITPASSWORD: u32 = 4;
pub const APR_URI_UNP_OMITUSERINFO: u32 = 6;
pub const APR_URI_UNP_REVEALPASSWORD: u32 = 8;
pub const APR_URI_UNP_OMITPATHINFO: u32 = 16;
pub const APR_URI_UNP_OMITQUERY: u32 = 32;
pub const PROXYREQ_NONE: u32 = 0;
pub const PROXYREQ_PROXY: u32 = 1;
pub const PROXYREQ_REVERSE: u32 = 2;
pub const PROXYREQ_RESPONSE: u32 = 3;
pub const DEFAULT_VHOST_ADDR: u32 = 4294967295;
pub const SIGSTOP_DETACH: u32 = 1;
pub const SIGSTOP_MAKE_CHILD: u32 = 2;
pub const SIGSTOP_SPAWN_CHILD: u32 = 4;
pub const SIGSTOP_PIPED_LOG_SPAWN: u32 = 8;
pub const SIGSTOP_CGI_CHILD: u32 = 16;
pub const AP_NORESTART: u32 = 120001;
pub const OR_NONE: u32 = 0;
pub const OR_LIMIT: u32 = 1;
pub const OR_OPTIONS: u32 = 2;
pub const OR_FILEINFO: u32 = 4;
pub const OR_AUTHCFG: u32 = 8;
pub const OR_INDEXES: u32 = 16;
pub const OR_UNSET: u32 = 32;
pub const ACCESS_CONF: u32 = 64;
pub const RSRC_CONF: u32 = 128;
pub const EXEC_ON_READ: u32 = 256;
pub const NONFATAL_OVERRIDE: u32 = 512;
pub const NONFATAL_UNKNOWN: u32 = 1024;
pub const NONFATAL_ALL: u32 = 1536;
pub const OR_ALL: u32 = 31;
pub const DECLINE_CMD: &'static [u8; 3usize] = b"\x07\x08\0";
pub const NOT_IN_VIRTUALHOST: u32 = 1;
pub const NOT_IN_LIMIT: u32 = 2;
pub const NOT_IN_DIRECTORY: u32 = 4;
pub const NOT_IN_LOCATION: u32 = 8;
pub const NOT_IN_FILES: u32 = 16;
pub const NOT_IN_HTACCESS: u32 = 32;
pub const NOT_IN_DIR_LOC_FILE: u32 = 28;
pub const GLOBAL_ONLY: u32 = 31;

pub type __u_char = ::libc::c_uchar;
pub type __u_short = ::libc::c_ushort;
pub type __u_int = ::libc::c_uint;
pub type __u_long = ::libc::c_ulong;
pub type __int8_t = ::libc::c_schar;
pub type __uint8_t = ::libc::c_uchar;
pub type __int16_t = ::libc::c_short;
pub type __uint16_t = ::libc::c_ushort;
pub type __int32_t = ::libc::c_int;
pub type __uint32_t = ::libc::c_uint;
pub type __int64_t = ::libc::c_long;
pub type __uint64_t = ::libc::c_ulong;
pub type __quad_t = ::libc::c_long;
pub type __u_quad_t = ::libc::c_ulong;
pub type __dev_t = ::libc::c_ulong;
pub type __uid_t = ::libc::c_uint;
pub type __gid_t = ::libc::c_uint;
pub type __ino_t = ::libc::c_ulong;
pub type __ino64_t = ::libc::c_ulong;
pub type __mode_t = ::libc::c_uint;
pub type __nlink_t = ::libc::c_ulong;
pub type __off_t = ::libc::c_long;
pub type __off64_t = ::libc::c_long;
pub type __pid_t = ::libc::c_int;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t { pub __val: [::libc::c_int; 2usize] }

#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::std::mem::size_of::<__fsid_t>(), 8usize, concat!( "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq!(::std::mem::align_of::<__fsid_t>(), 4usize, concat!( "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __fsid_t ) , "::" , stringify ! ( __val ) ));
}

pub type __clock_t = ::libc::c_long;
pub type __rlim_t = ::libc::c_ulong;
pub type __rlim64_t = ::libc::c_ulong;
pub type __id_t = ::libc::c_uint;
pub type __time_t = ::libc::c_long;
pub type __useconds_t = ::libc::c_uint;
pub type __suseconds_t = ::libc::c_long;
pub type __daddr_t = ::libc::c_int;
pub type __key_t = ::libc::c_int;
pub type __clockid_t = ::libc::c_int;
pub type __timer_t = *mut ::libc::c_void;
pub type __blksize_t = ::libc::c_long;
pub type __blkcnt_t = ::libc::c_long;
pub type __blkcnt64_t = ::libc::c_long;
pub type __fsblkcnt_t = ::libc::c_ulong;
pub type __fsblkcnt64_t = ::libc::c_ulong;
pub type __fsfilcnt_t = ::libc::c_ulong;
pub type __fsfilcnt64_t = ::libc::c_ulong;
pub type __fsword_t = ::libc::c_long;
pub type __ssize_t = ::libc::c_long;
pub type __syscall_slong_t = ::libc::c_long;
pub type __syscall_ulong_t = ::libc::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::libc::c_char;
pub type __intptr_t = ::libc::c_long;
pub type __socklen_t = ::libc::c_uint;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::libc::c_ulong;
pub type ushort = ::libc::c_ushort;
pub type uint = ::libc::c_uint;
pub type u_int8_t = ::libc::c_uchar;
pub type u_int16_t = ::libc::c_ushort;
pub type u_int32_t = ::libc::c_uint;
pub type u_int64_t = ::libc::c_ulong;
pub type register_t = ::libc::c_long;
pub type __sig_atomic_t = ::libc::c_int;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t { pub __val: [::libc::c_ulong; 16usize] }

#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(::std::mem::size_of::<__sigset_t>(), 128usize, concat!( "Size of: " , stringify ! ( __sigset_t ) ));
    assert_eq!(::std::mem::align_of::<__sigset_t>(), 8usize, concat!( "Alignment of " , stringify ! ( __sigset_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __sigset_t ) , "::" , stringify ! ( __val ) ));
}

pub type sigset_t = __sigset_t;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec { pub tv_sec: __time_t, pub tv_nsec: __syscall_slong_t }

#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>(), 16usize, concat!( "Size of: " , stringify ! ( timespec ) ));
    assert_eq!(::std::mem::align_of::<timespec>(), 8usize, concat!( "Alignment of " , stringify ! ( timespec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( timespec ) , "::" , stringify ! ( tv_sec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( timespec ) , "::" , stringify ! ( tv_nsec ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval { pub tv_sec: __time_t, pub tv_usec: __suseconds_t }

#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::std::mem::size_of::<timeval>(), 16usize, concat!( "Size of: " , stringify ! ( timeval ) ));
    assert_eq!(::std::mem::align_of::<timeval>(), 8usize, concat!( "Alignment of " , stringify ! ( timeval ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( timeval ) , "::" , stringify ! ( tv_sec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( timeval ) , "::" , stringify ! ( tv_usec ) ));
}

pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::libc::c_long;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set { pub __fds_bits: [__fd_mask; 16usize] }

#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::std::mem::size_of::<fd_set>(), 128usize, concat!( "Size of: " , stringify ! ( fd_set ) ));
    assert_eq!(::std::mem::align_of::<fd_set>(), 8usize, concat!( "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( fd_set ) , "::" , stringify ! ( __fds_bits ) ));
}

pub type fd_mask = __fd_mask;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type pthread_t = ::libc::c_ulong;

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t { pub __size: [::libc::c_char; 56usize], pub __align: ::libc::c_long, _bindgen_union_align: [u64; 7usize] }

#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(::std::mem::size_of::<pthread_attr_t>(), 56usize, concat!( "Size of: " , stringify ! ( pthread_attr_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_attr_t>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_attr_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_attr_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_attr_t ) , "::" , stringify ! ( __align ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list { pub __prev: *mut __pthread_internal_list, pub __next: *mut __pthread_internal_list }

#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(::std::mem::size_of::<__pthread_internal_list>(), 16usize, concat!( "Size of: " , stringify ! ( __pthread_internal_list ) ));
    assert_eq!(::std::mem::align_of::<__pthread_internal_list>(), 8usize, concat!( "Alignment of " , stringify ! ( __pthread_internal_list ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __pthread_internal_list ) , "::" , stringify ! ( __prev ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( __pthread_internal_list ) , "::" , stringify ! ( __next ) ));
}

pub type __pthread_list_t = __pthread_internal_list;

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t { pub __data: pthread_mutex_t___pthread_mutex_s, pub __size: [::libc::c_char; 40usize], pub __align: ::libc::c_long, _bindgen_union_align: [u64; 5usize] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex_t___pthread_mutex_s { pub __lock: ::libc::c_int, pub __count: ::libc::c_uint, pub __owner: ::libc::c_int, pub __nusers: ::libc::c_uint, pub __kind: ::libc::c_int, pub __spins: ::libc::c_short, pub __elision: ::libc::c_short, pub __list: __pthread_list_t }

#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>(), 40usize, concat!( "Size of: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) ));
    assert_eq!(::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__lock as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! ( __lock ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__count as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! ( __count ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__owner as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! ( __owner ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__nusers as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! ( __nusers ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__kind as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! ( __kind ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__spins as *const _ as usize }, 20usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! ( __spins ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__elision as *const _ as usize }, 22usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! ( __elision ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__list as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! ( __list ) ));
}

#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t>(), 40usize, concat!( "Size of: " , stringify ! ( pthread_mutex_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_mutex_t>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_mutex_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t ) , "::" , stringify ! ( __data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_mutex_t ) , "::" , stringify ! ( __align ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t { pub __size: [::libc::c_char; 4usize], pub __align: ::libc::c_int, _bindgen_union_align: u32 }

#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutexattr_t>(), 4usize, concat!( "Size of: " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_mutexattr_t>(), 4usize, concat!( "Alignment of " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_mutexattr_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_mutexattr_t ) , "::" , stringify ! ( __align ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t { pub __data: pthread_cond_t__bindgen_ty_1, pub __size: [::libc::c_char; 48usize], pub __align: ::libc::c_longlong, _bindgen_union_align: [u64; 6usize] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_t__bindgen_ty_1 { pub __lock: ::libc::c_int, pub __futex: ::libc::c_uint, pub __total_seq: ::libc::c_ulonglong, pub __wakeup_seq: ::libc::c_ulonglong, pub __woken_seq: ::libc::c_ulonglong, pub __mutex: *mut ::libc::c_void, pub __nwaiters: ::libc::c_uint, pub __broadcast_seq: ::libc::c_uint }

#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>(), 48usize, concat!( "Size of: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__lock as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__futex as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __futex ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__total_seq as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __total_seq ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__wakeup_seq as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __wakeup_seq ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__woken_seq as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __woken_seq ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__mutex as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __mutex ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__nwaiters as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __nwaiters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__broadcast_seq as *const _ as usize }, 44usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __broadcast_seq ) ));
}

#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t>(), 48usize, concat!( "Size of: " , stringify ! ( pthread_cond_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_cond_t>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_cond_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t ) , "::" , stringify ! ( __data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_cond_t ) , "::" , stringify ! ( __align ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t { pub __size: [::libc::c_char; 4usize], pub __align: ::libc::c_int, _bindgen_union_align: u32 }

#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_condattr_t>(), 4usize, concat!( "Size of: " , stringify ! ( pthread_condattr_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_condattr_t>(), 4usize, concat!( "Alignment of " , stringify ! ( pthread_condattr_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_condattr_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_condattr_t ) , "::" , stringify ! ( __align ) ));
}

pub type pthread_key_t = ::libc::c_uint;
pub type pthread_once_t = ::libc::c_int;

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t { pub __data: pthread_rwlock_t__bindgen_ty_1, pub __size: [::libc::c_char; 56usize], pub __align: ::libc::c_long, _bindgen_union_align: [u64; 7usize] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlock_t__bindgen_ty_1 { pub __lock: ::libc::c_int, pub __nr_readers: ::libc::c_uint, pub __readers_wakeup: ::libc::c_uint, pub __writer_wakeup: ::libc::c_uint, pub __nr_readers_queued: ::libc::c_uint, pub __nr_writers_queued: ::libc::c_uint, pub __writer: ::libc::c_int, pub __shared: ::libc::c_int, pub __rwelision: ::libc::c_schar, pub __pad1: [::libc::c_uchar; 7usize], pub __pad2: ::libc::c_ulong, pub __flags: ::libc::c_uint }

#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>(), 56usize, concat!( "Size of: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__lock as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__nr_readers as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __nr_readers ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__readers_wakeup as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __readers_wakeup ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__writer_wakeup as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __writer_wakeup ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__nr_readers_queued as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __nr_readers_queued ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__nr_writers_queued as *const _ as usize }, 20usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __nr_writers_queued ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__writer as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __writer ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__shared as *const _ as usize }, 28usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __shared ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__rwelision as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __rwelision ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__pad1 as *const _ as usize }, 33usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__pad2 as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad2 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__flags as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __flags ) ));
}

#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t>(), 56usize, concat!( "Size of: " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_rwlock_t>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t ) , "::" , stringify ! ( __data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlock_t ) , "::" , stringify ! ( __align ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t { pub __size: [::libc::c_char; 8usize], pub __align: ::libc::c_long, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlockattr_t>(), 8usize, concat!( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_rwlockattr_t>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlockattr_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_rwlockattr_t ) , "::" , stringify ! ( __align ) ));
}

pub type pthread_spinlock_t = ::libc::c_int;

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t { pub __size: [::libc::c_char; 32usize], pub __align: ::libc::c_long, _bindgen_union_align: [u64; 4usize] }

#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrier_t>(), 32usize, concat!( "Size of: " , stringify ! ( pthread_barrier_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_barrier_t>(), 8usize, concat!( "Alignment of " , stringify ! ( pthread_barrier_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_barrier_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_barrier_t ) , "::" , stringify ! ( __align ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t { pub __size: [::libc::c_char; 4usize], pub __align: ::libc::c_int, _bindgen_union_align: u32 }

#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrierattr_t>(), 4usize, concat!( "Size of: " , stringify ! ( pthread_barrierattr_t ) ));
    assert_eq!(::std::mem::align_of::<pthread_barrierattr_t>(), 4usize, concat!( "Alignment of " , stringify ! ( pthread_barrierattr_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_barrierattr_t ) , "::" , stringify ! ( __size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( pthread_barrierattr_t ) , "::" , stringify ! ( __align ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec { pub iov_base: *mut ::libc::c_void, pub iov_len: usize }

#[test]
fn bindgen_test_layout_iovec() {
    assert_eq!(::std::mem::size_of::<iovec>(), 16usize, concat!( "Size of: " , stringify ! ( iovec ) ));
    assert_eq!(::std::mem::align_of::<iovec>(), 8usize, concat!( "Alignment of " , stringify ! ( iovec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<iovec>())).iov_base as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( iovec ) , "::" , stringify ! ( iov_base ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<iovec>())).iov_len as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( iovec ) , "::" , stringify ! ( iov_len ) ));
}

pub type socklen_t = __socklen_t;

pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;

pub type __socket_type = u32;
pub type sa_family_t = ::libc::c_ushort;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr { pub sa_family: sa_family_t, pub sa_data: [::libc::c_char; 14usize] }

#[test]
fn bindgen_test_layout_sockaddr() {
    assert_eq!(::std::mem::size_of::<sockaddr>(), 16usize, concat!( "Size of: " , stringify ! ( sockaddr ) ));
    assert_eq!(::std::mem::align_of::<sockaddr>(), 2usize, concat!( "Alignment of " , stringify ! ( sockaddr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_family as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sockaddr ) , "::" , stringify ! ( sa_family ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_data as *const _ as usize }, 2usize, concat!( "Offset of field: " , stringify ! ( sockaddr ) , "::" , stringify ! ( sa_data ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_storage { pub ss_family: sa_family_t, pub __ss_padding: [::libc::c_char; 118usize], pub __ss_align: ::libc::c_ulong }

#[test]
fn bindgen_test_layout_sockaddr_storage() {
    assert_eq!(::std::mem::size_of::<sockaddr_storage>(), 128usize, concat!( "Size of: " , stringify ! ( sockaddr_storage ) ));
    assert_eq!(::std::mem::align_of::<sockaddr_storage>(), 8usize, concat!( "Alignment of " , stringify ! ( sockaddr_storage ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).ss_family as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sockaddr_storage ) , "::" , stringify ! ( ss_family ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_padding as *const _ as usize }, 2usize, concat!( "Offset of field: " , stringify ! ( sockaddr_storage ) , "::" , stringify ! ( __ss_padding ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_align as *const _ as usize }, 120usize, concat!( "Offset of field: " , stringify ! ( sockaddr_storage ) , "::" , stringify ! ( __ss_align ) ));
}

pub const MSG_OOB: _bindgen_ty_1 = 1;
pub const MSG_PEEK: _bindgen_ty_1 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_1 = 4;
pub const MSG_CTRUNC: _bindgen_ty_1 = 8;
pub const MSG_PROXY: _bindgen_ty_1 = 16;
pub const MSG_TRUNC: _bindgen_ty_1 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_1 = 64;
pub const MSG_EOR: _bindgen_ty_1 = 128;
pub const MSG_WAITALL: _bindgen_ty_1 = 256;
pub const MSG_FIN: _bindgen_ty_1 = 512;
pub const MSG_SYN: _bindgen_ty_1 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_1 = 2048;
pub const MSG_RST: _bindgen_ty_1 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_1 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_1 = 16384;
pub const MSG_MORE: _bindgen_ty_1 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_1 = 65536;
pub const MSG_FASTOPEN: _bindgen_ty_1 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = 1073741824;

pub type _bindgen_ty_1 = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr { pub msg_name: *mut ::libc::c_void, pub msg_namelen: socklen_t, pub msg_iov: *mut iovec, pub msg_iovlen: usize, pub msg_control: *mut ::libc::c_void, pub msg_controllen: usize, pub msg_flags: ::libc::c_int }

#[test]
fn bindgen_test_layout_msghdr() {
    assert_eq!(::std::mem::size_of::<msghdr>(), 56usize, concat!( "Size of: " , stringify ! ( msghdr ) ));
    assert_eq!(::std::mem::align_of::<msghdr>(), 8usize, concat!( "Alignment of " , stringify ! ( msghdr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<msghdr>())).msg_name as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( msghdr ) , "::" , stringify ! ( msg_name ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<msghdr>())).msg_namelen as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( msghdr ) , "::" , stringify ! ( msg_namelen ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iov as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( msghdr ) , "::" , stringify ! ( msg_iov ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iovlen as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( msghdr ) , "::" , stringify ! ( msg_iovlen ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<msghdr>())).msg_control as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( msghdr ) , "::" , stringify ! ( msg_control ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<msghdr>())).msg_controllen as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( msghdr ) , "::" , stringify ! ( msg_controllen ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<msghdr>())).msg_flags as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( msghdr ) , "::" , stringify ! ( msg_flags ) ));
}

#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr { pub cmsg_len: usize, pub cmsg_level: ::libc::c_int, pub cmsg_type: ::libc::c_int, pub __cmsg_data: __IncompleteArrayField<::libc::c_uchar> }

#[test]
fn bindgen_test_layout_cmsghdr() {
    assert_eq!(::std::mem::size_of::<cmsghdr>(), 16usize, concat!( "Size of: " , stringify ! ( cmsghdr ) ));
    assert_eq!(::std::mem::align_of::<cmsghdr>(), 8usize, concat!( "Alignment of " , stringify ! ( cmsghdr ) ));
}

pub const SCM_RIGHTS: _bindgen_ty_2 = 1;

pub type _bindgen_ty_2 = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger { pub l_onoff: ::libc::c_int, pub l_linger: ::libc::c_int }

#[test]
fn bindgen_test_layout_linger() {
    assert_eq!(::std::mem::size_of::<linger>(), 8usize, concat!( "Size of: " , stringify ! ( linger ) ));
    assert_eq!(::std::mem::align_of::<linger>(), 4usize, concat!( "Alignment of " , stringify ! ( linger ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<linger>())).l_onoff as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( linger ) , "::" , stringify ! ( l_onoff ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<linger>())).l_linger as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( linger ) , "::" , stringify ! ( l_linger ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr { pub sa_family: ::libc::c_ushort, pub sa_data: [::libc::c_uchar; 14usize] }

#[test]
fn bindgen_test_layout_osockaddr() {
    assert_eq!(::std::mem::size_of::<osockaddr>(), 16usize, concat!( "Size of: " , stringify ! ( osockaddr ) ));
    assert_eq!(::std::mem::align_of::<osockaddr>(), 2usize, concat!( "Alignment of " , stringify ! ( osockaddr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<osockaddr>())).sa_family as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( osockaddr ) , "::" , stringify ! ( sa_family ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<osockaddr>())).sa_data as *const _ as usize }, 2usize, concat!( "Offset of field: " , stringify ! ( osockaddr ) , "::" , stringify ! ( sa_data ) ));
}

pub const SHUT_RD: _bindgen_ty_3 = 0;
pub const SHUT_WR: _bindgen_ty_3 = 1;
pub const SHUT_RDWR: _bindgen_ty_3 = 2;

pub type _bindgen_ty_3 = u32;
pub type int_least8_t = ::libc::c_schar;
pub type int_least16_t = ::libc::c_short;
pub type int_least32_t = ::libc::c_int;
pub type int_least64_t = ::libc::c_long;
pub type uint_least8_t = ::libc::c_uchar;
pub type uint_least16_t = ::libc::c_ushort;
pub type uint_least32_t = ::libc::c_uint;
pub type uint_least64_t = ::libc::c_ulong;
pub type int_fast8_t = ::libc::c_schar;
pub type int_fast16_t = ::libc::c_long;
pub type int_fast32_t = ::libc::c_long;
pub type int_fast64_t = ::libc::c_long;
pub type uint_fast8_t = ::libc::c_uchar;
pub type uint_fast16_t = ::libc::c_ulong;
pub type uint_fast32_t = ::libc::c_ulong;
pub type uint_fast64_t = ::libc::c_ulong;
pub type intmax_t = ::libc::c_long;
pub type uintmax_t = ::libc::c_ulong;
pub type sig_atomic_t = __sig_atomic_t;

#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval { pub sival_int: ::libc::c_int, pub sival_ptr: *mut ::libc::c_void, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_sigval() {
    assert_eq!(::std::mem::size_of::<sigval>(), 8usize, concat!( "Size of: " , stringify ! ( sigval ) ));
    assert_eq!(::std::mem::align_of::<sigval>(), 8usize, concat!( "Alignment of " , stringify ! ( sigval ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigval>())).sival_int as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigval ) , "::" , stringify ! ( sival_int ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigval>())).sival_ptr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigval ) , "::" , stringify ! ( sival_ptr ) ));
}

pub type sigval_t = sigval;
pub type __sigchld_clock_t = __clock_t;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t { pub si_signo: ::libc::c_int, pub si_errno: ::libc::c_int, pub si_code: ::libc::c_int, pub _sifields: siginfo_t__bindgen_ty_1 }

#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1 { pub _pad: [::libc::c_int; 28usize], pub _kill: siginfo_t__bindgen_ty_1__bindgen_ty_1, pub _timer: siginfo_t__bindgen_ty_1__bindgen_ty_2, pub _rt: siginfo_t__bindgen_ty_1__bindgen_ty_3, pub _sigchld: siginfo_t__bindgen_ty_1__bindgen_ty_4, pub _sigfault: siginfo_t__bindgen_ty_1__bindgen_ty_5, pub _sigpoll: siginfo_t__bindgen_ty_1__bindgen_ty_6, pub _sigsys: siginfo_t__bindgen_ty_1__bindgen_ty_7, _bindgen_union_align: [u64; 14usize] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1 { pub si_pid: __pid_t, pub si_uid: __uid_t }

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>(), 8usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>(), 4usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_1>())).si_pid as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( si_pid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_1>())).si_uid as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( si_uid ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_2 { pub si_tid: ::libc::c_int, pub si_overrun: ::libc::c_int, pub si_sigval: sigval_t }

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>(), 16usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_2 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_2 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_2>())).si_tid as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! ( si_tid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_2>())).si_overrun as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! ( si_overrun ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_2>())).si_sigval as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! ( si_sigval ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_3 { pub si_pid: __pid_t, pub si_uid: __uid_t, pub si_sigval: sigval_t }

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>(), 16usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_3 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_3 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_3>())).si_pid as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! ( si_pid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_3>())).si_uid as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! ( si_uid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_3>())).si_sigval as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! ( si_sigval ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_4 { pub si_pid: __pid_t, pub si_uid: __uid_t, pub si_status: ::libc::c_int, pub si_utime: __sigchld_clock_t, pub si_stime: __sigchld_clock_t }

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_4() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>(), 32usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_4>())).si_pid as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) , "::" , stringify ! ( si_pid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_4>())).si_uid as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) , "::" , stringify ! ( si_uid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_4>())).si_status as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) , "::" , stringify ! ( si_status ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_4>())).si_utime as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) , "::" , stringify ! ( si_utime ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_4>())).si_stime as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) , "::" , stringify ! ( si_stime ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5 { pub si_addr: *mut ::libc::c_void, pub si_addr_lsb: ::libc::c_short, pub si_addr_bnd: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 { pub _lower: *mut ::libc::c_void, pub _upper: *mut ::libc::c_void }

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>(), 16usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>()))._lower as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 ) , "::" , stringify ! ( _lower ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>()))._upper as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 ) , "::" , stringify ! ( _upper ) ));
}

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_5() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>(), 32usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_5>())).si_addr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5 ) , "::" , stringify ! ( si_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_5>())).si_addr_lsb as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5 ) , "::" , stringify ! ( si_addr_lsb ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_5>())).si_addr_bnd as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5 ) , "::" , stringify ! ( si_addr_bnd ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_6 { pub si_band: ::libc::c_long, pub si_fd: ::libc::c_int }

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_6() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>(), 16usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_6 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_6 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_6>())).si_band as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_6 ) , "::" , stringify ! ( si_band ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_6>())).si_fd as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_6 ) , "::" , stringify ! ( si_fd ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_7 { pub _call_addr: *mut ::libc::c_void, pub _syscall: ::libc::c_int, pub _arch: ::libc::c_uint }

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_7() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>(), 16usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_7 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_7 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_7>()))._call_addr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_7 ) , "::" , stringify ! ( _call_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_7>()))._syscall as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_7 ) , "::" , stringify ! ( _syscall ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1__bindgen_ty_7>()))._arch as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_7 ) , "::" , stringify ! ( _arch ) ));
}

#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<siginfo_t__bindgen_ty_1>(), 112usize, concat!( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1>()))._pad as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1 ) , "::" , stringify ! ( _pad ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1>()))._kill as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1 ) , "::" , stringify ! ( _kill ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1>()))._timer as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1 ) , "::" , stringify ! ( _timer ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1>()))._rt as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1 ) , "::" , stringify ! ( _rt ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1>()))._sigchld as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1 ) , "::" , stringify ! ( _sigchld ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1>()))._sigfault as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1 ) , "::" , stringify ! ( _sigfault ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1>()))._sigpoll as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1 ) , "::" , stringify ! ( _sigpoll ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t__bindgen_ty_1>()))._sigsys as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t__bindgen_ty_1 ) , "::" , stringify ! ( _sigsys ) ));
}

#[test]
fn bindgen_test_layout_siginfo_t() {
    assert_eq!(::std::mem::size_of::<siginfo_t>(), 128usize, concat!( "Size of: " , stringify ! ( siginfo_t ) ));
    assert_eq!(::std::mem::align_of::<siginfo_t>(), 8usize, concat!( "Alignment of " , stringify ! ( siginfo_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t>())).si_signo as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( siginfo_t ) , "::" , stringify ! ( si_signo ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t>())).si_errno as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( siginfo_t ) , "::" , stringify ! ( si_errno ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t>())).si_code as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( siginfo_t ) , "::" , stringify ! ( si_code ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<siginfo_t>()))._sifields as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( siginfo_t ) , "::" , stringify ! ( _sifields ) ));
}

pub const SI_ASYNCNL: _bindgen_ty_4 = -60;
pub const SI_TKILL: _bindgen_ty_4 = -6;
pub const SI_SIGIO: _bindgen_ty_4 = -5;
pub const SI_ASYNCIO: _bindgen_ty_4 = -4;
pub const SI_MESGQ: _bindgen_ty_4 = -3;
pub const SI_TIMER: _bindgen_ty_4 = -2;
pub const SI_QUEUE: _bindgen_ty_4 = -1;
pub const SI_USER: _bindgen_ty_4 = 0;
pub const SI_KERNEL: _bindgen_ty_4 = 128;

pub type _bindgen_ty_4 = i32;

pub const ILL_ILLOPC: _bindgen_ty_5 = 1;
pub const ILL_ILLOPN: _bindgen_ty_5 = 2;
pub const ILL_ILLADR: _bindgen_ty_5 = 3;
pub const ILL_ILLTRP: _bindgen_ty_5 = 4;
pub const ILL_PRVOPC: _bindgen_ty_5 = 5;
pub const ILL_PRVREG: _bindgen_ty_5 = 6;
pub const ILL_COPROC: _bindgen_ty_5 = 7;
pub const ILL_BADSTK: _bindgen_ty_5 = 8;

pub type _bindgen_ty_5 = u32;

pub const FPE_INTDIV: _bindgen_ty_6 = 1;
pub const FPE_INTOVF: _bindgen_ty_6 = 2;
pub const FPE_FLTDIV: _bindgen_ty_6 = 3;
pub const FPE_FLTOVF: _bindgen_ty_6 = 4;
pub const FPE_FLTUND: _bindgen_ty_6 = 5;
pub const FPE_FLTRES: _bindgen_ty_6 = 6;
pub const FPE_FLTINV: _bindgen_ty_6 = 7;
pub const FPE_FLTSUB: _bindgen_ty_6 = 8;

pub type _bindgen_ty_6 = u32;

pub const SEGV_MAPERR: _bindgen_ty_7 = 1;
pub const SEGV_ACCERR: _bindgen_ty_7 = 2;

pub type _bindgen_ty_7 = u32;

pub const BUS_ADRALN: _bindgen_ty_8 = 1;
pub const BUS_ADRERR: _bindgen_ty_8 = 2;
pub const BUS_OBJERR: _bindgen_ty_8 = 3;
pub const BUS_MCEERR_AR: _bindgen_ty_8 = 4;
pub const BUS_MCEERR_AO: _bindgen_ty_8 = 5;

pub type _bindgen_ty_8 = u32;

pub const CLD_EXITED: _bindgen_ty_9 = 1;
pub const CLD_KILLED: _bindgen_ty_9 = 2;
pub const CLD_DUMPED: _bindgen_ty_9 = 3;
pub const CLD_TRAPPED: _bindgen_ty_9 = 4;
pub const CLD_STOPPED: _bindgen_ty_9 = 5;
pub const CLD_CONTINUED: _bindgen_ty_9 = 6;

pub type _bindgen_ty_9 = u32;

pub const POLL_IN: _bindgen_ty_10 = 1;
pub const POLL_OUT: _bindgen_ty_10 = 2;
pub const POLL_MSG: _bindgen_ty_10 = 3;
pub const POLL_ERR: _bindgen_ty_10 = 4;
pub const POLL_PRI: _bindgen_ty_10 = 5;
pub const POLL_HUP: _bindgen_ty_10 = 6;

pub type _bindgen_ty_10 = u32;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent { pub sigev_value: sigval_t, pub sigev_signo: ::libc::c_int, pub sigev_notify: ::libc::c_int, pub _sigev_un: sigevent__bindgen_ty_1 }

#[repr(C)]
#[derive(Copy, Clone)]
pub union sigevent__bindgen_ty_1 { pub _pad: [::libc::c_int; 12usize], pub _tid: __pid_t, pub _sigev_thread: sigevent__bindgen_ty_1__bindgen_ty_1, _bindgen_union_align: [u64; 6usize] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent__bindgen_ty_1__bindgen_ty_1 { pub _function: ::std::option::Option<unsafe extern "C" fn(arg1: sigval_t)>, pub _attribute: *mut pthread_attr_t }

#[test]
fn bindgen_test_layout_sigevent__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sigevent__bindgen_ty_1__bindgen_ty_1>(), 16usize, concat!( "Size of: " , stringify ! ( sigevent__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<sigevent__bindgen_ty_1__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( sigevent__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent__bindgen_ty_1__bindgen_ty_1>()))._function as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigevent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _function ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent__bindgen_ty_1__bindgen_ty_1>()))._attribute as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( sigevent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _attribute ) ));
}

#[test]
fn bindgen_test_layout_sigevent__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sigevent__bindgen_ty_1>(), 48usize, concat!( "Size of: " , stringify ! ( sigevent__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<sigevent__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( sigevent__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent__bindgen_ty_1>()))._pad as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigevent__bindgen_ty_1 ) , "::" , stringify ! ( _pad ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent__bindgen_ty_1>()))._tid as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigevent__bindgen_ty_1 ) , "::" , stringify ! ( _tid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent__bindgen_ty_1>()))._sigev_thread as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigevent__bindgen_ty_1 ) , "::" , stringify ! ( _sigev_thread ) ));
}

#[test]
fn bindgen_test_layout_sigevent() {
    assert_eq!(::std::mem::size_of::<sigevent>(), 64usize, concat!( "Size of: " , stringify ! ( sigevent ) ));
    assert_eq!(::std::mem::align_of::<sigevent>(), 8usize, concat!( "Alignment of " , stringify ! ( sigevent ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent>())).sigev_value as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigevent ) , "::" , stringify ! ( sigev_value ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent>())).sigev_signo as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( sigevent ) , "::" , stringify ! ( sigev_signo ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent>())).sigev_notify as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( sigevent ) , "::" , stringify ! ( sigev_notify ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigevent>()))._sigev_un as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( sigevent ) , "::" , stringify ! ( _sigev_un ) ));
}

pub type sigevent_t = sigevent;

pub const SIGEV_SIGNAL: _bindgen_ty_11 = 0;
pub const SIGEV_NONE: _bindgen_ty_11 = 1;
pub const SIGEV_THREAD: _bindgen_ty_11 = 2;
pub const SIGEV_THREAD_ID: _bindgen_ty_11 = 4;

pub type _bindgen_ty_11 = u32;
pub type __sighandler_t = ::std::option::Option<unsafe extern "C" fn(arg1: ::libc::c_int)>;
pub type sig_t = __sighandler_t;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction { pub __sigaction_handler: sigaction__bindgen_ty_1, pub sa_mask: __sigset_t, pub sa_flags: ::libc::c_int, pub sa_restorer: ::std::option::Option<unsafe extern "C" fn()> }

#[repr(C)]
#[derive(Copy, Clone)]
pub union sigaction__bindgen_ty_1 { pub sa_handler: __sighandler_t, pub sa_sigaction: ::std::option::Option<unsafe extern "C" fn(arg1: ::libc::c_int, arg2: *mut siginfo_t, arg3: *mut ::libc::c_void)>, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_sigaction__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sigaction__bindgen_ty_1>(), 8usize, concat!( "Size of: " , stringify ! ( sigaction__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<sigaction__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( sigaction__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaction__bindgen_ty_1>())).sa_handler as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigaction__bindgen_ty_1 ) , "::" , stringify ! ( sa_handler ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaction__bindgen_ty_1>())).sa_sigaction as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigaction__bindgen_ty_1 ) , "::" , stringify ! ( sa_sigaction ) ));
}

#[test]
fn bindgen_test_layout_sigaction() {
    assert_eq!(::std::mem::size_of::<sigaction>(), 152usize, concat!( "Size of: " , stringify ! ( sigaction ) ));
    assert_eq!(::std::mem::align_of::<sigaction>(), 8usize, concat!( "Alignment of " , stringify ! ( sigaction ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaction>())).__sigaction_handler as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigaction ) , "::" , stringify ! ( __sigaction_handler ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaction>())).sa_mask as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( sigaction ) , "::" , stringify ! ( sa_mask ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaction>())).sa_flags as *const _ as usize }, 136usize, concat!( "Offset of field: " , stringify ! ( sigaction ) , "::" , stringify ! ( sa_flags ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaction>())).sa_restorer as *const _ as usize }, 144usize, concat!( "Offset of field: " , stringify ! ( sigaction ) , "::" , stringify ! ( sa_restorer ) ));
}

extern "C" {
    #[link_name = "\u{1}_sys_siglist"]
    pub static mut _sys_siglist: [*const ::libc::c_char; 65usize];
}

extern "C" {
    #[link_name = "\u{1}sys_siglist"]
    pub static mut sys_siglist: [*const ::libc::c_char; 65usize];
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _fpx_sw_bytes { pub magic1: __uint32_t, pub extended_size: __uint32_t, pub xstate_bv: __uint64_t, pub xstate_size: __uint32_t, pub padding: [__uint32_t; 7usize] }

#[test]
fn bindgen_test_layout__fpx_sw_bytes() {
    assert_eq!(::std::mem::size_of::<_fpx_sw_bytes>(), 48usize, concat!( "Size of: " , stringify ! ( _fpx_sw_bytes ) ));
    assert_eq!(::std::mem::align_of::<_fpx_sw_bytes>(), 8usize, concat!( "Alignment of " , stringify ! ( _fpx_sw_bytes ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpx_sw_bytes>())).magic1 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _fpx_sw_bytes ) , "::" , stringify ! ( magic1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpx_sw_bytes>())).extended_size as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( _fpx_sw_bytes ) , "::" , stringify ! ( extended_size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpx_sw_bytes>())).xstate_bv as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _fpx_sw_bytes ) , "::" , stringify ! ( xstate_bv ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpx_sw_bytes>())).xstate_size as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( _fpx_sw_bytes ) , "::" , stringify ! ( xstate_size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpx_sw_bytes>())).padding as *const _ as usize }, 20usize, concat!( "Offset of field: " , stringify ! ( _fpx_sw_bytes ) , "::" , stringify ! ( padding ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _fpreg { pub significand: [::libc::c_ushort; 4usize], pub exponent: ::libc::c_ushort }

#[test]
fn bindgen_test_layout__fpreg() {
    assert_eq!(::std::mem::size_of::<_fpreg>(), 10usize, concat!( "Size of: " , stringify ! ( _fpreg ) ));
    assert_eq!(::std::mem::align_of::<_fpreg>(), 2usize, concat!( "Alignment of " , stringify ! ( _fpreg ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpreg>())).significand as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _fpreg ) , "::" , stringify ! ( significand ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpreg>())).exponent as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _fpreg ) , "::" , stringify ! ( exponent ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _fpxreg { pub significand: [::libc::c_ushort; 4usize], pub exponent: ::libc::c_ushort, pub padding: [::libc::c_ushort; 3usize] }

#[test]
fn bindgen_test_layout__fpxreg() {
    assert_eq!(::std::mem::size_of::<_fpxreg>(), 16usize, concat!( "Size of: " , stringify ! ( _fpxreg ) ));
    assert_eq!(::std::mem::align_of::<_fpxreg>(), 2usize, concat!( "Alignment of " , stringify ! ( _fpxreg ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpxreg>())).significand as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _fpxreg ) , "::" , stringify ! ( significand ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpxreg>())).exponent as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _fpxreg ) , "::" , stringify ! ( exponent ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpxreg>())).padding as *const _ as usize }, 10usize, concat!( "Offset of field: " , stringify ! ( _fpxreg ) , "::" , stringify ! ( padding ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmmreg { pub element: [__uint32_t; 4usize] }

#[test]
fn bindgen_test_layout__xmmreg() {
    assert_eq!(::std::mem::size_of::<_xmmreg>(), 16usize, concat!( "Size of: " , stringify ! ( _xmmreg ) ));
    assert_eq!(::std::mem::align_of::<_xmmreg>(), 4usize, concat!( "Alignment of " , stringify ! ( _xmmreg ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_xmmreg>())).element as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _xmmreg ) , "::" , stringify ! ( element ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _fpstate { pub cwd: __uint16_t, pub swd: __uint16_t, pub ftw: __uint16_t, pub fop: __uint16_t, pub rip: __uint64_t, pub rdp: __uint64_t, pub mxcsr: __uint32_t, pub mxcr_mask: __uint32_t, pub _st: [_fpxreg; 8usize], pub _xmm: [_xmmreg; 16usize], pub padding: [__uint32_t; 24usize] }

#[test]
fn bindgen_test_layout__fpstate() {
    assert_eq!(::std::mem::size_of::<_fpstate>(), 512usize, concat!( "Size of: " , stringify ! ( _fpstate ) ));
    assert_eq!(::std::mem::align_of::<_fpstate>(), 8usize, concat!( "Alignment of " , stringify ! ( _fpstate ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).cwd as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( cwd ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).swd as *const _ as usize }, 2usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( swd ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).ftw as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( ftw ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).fop as *const _ as usize }, 6usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( fop ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).rip as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( rip ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).rdp as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( rdp ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).mxcsr as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( mxcsr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).mxcr_mask as *const _ as usize }, 28usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( mxcr_mask ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>()))._st as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( _st ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>()))._xmm as *const _ as usize }, 160usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( _xmm ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_fpstate>())).padding as *const _ as usize }, 416usize, concat!( "Offset of field: " , stringify ! ( _fpstate ) , "::" , stringify ! ( padding ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigcontext { pub r8: __uint64_t, pub r9: __uint64_t, pub r10: __uint64_t, pub r11: __uint64_t, pub r12: __uint64_t, pub r13: __uint64_t, pub r14: __uint64_t, pub r15: __uint64_t, pub rdi: __uint64_t, pub rsi: __uint64_t, pub rbp: __uint64_t, pub rbx: __uint64_t, pub rdx: __uint64_t, pub rax: __uint64_t, pub rcx: __uint64_t, pub rsp: __uint64_t, pub rip: __uint64_t, pub eflags: __uint64_t, pub cs: ::libc::c_ushort, pub gs: ::libc::c_ushort, pub fs: ::libc::c_ushort, pub __pad0: ::libc::c_ushort, pub err: __uint64_t, pub trapno: __uint64_t, pub oldmask: __uint64_t, pub cr2: __uint64_t, pub __bindgen_anon_1: sigcontext__bindgen_ty_1, pub __reserved1: [__uint64_t; 8usize] }

#[repr(C)]
#[derive(Copy, Clone)]
pub union sigcontext__bindgen_ty_1 { pub fpstate: *mut _fpstate, pub __fpstate_word: __uint64_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_sigcontext__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sigcontext__bindgen_ty_1>(), 8usize, concat!( "Size of: " , stringify ! ( sigcontext__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<sigcontext__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( sigcontext__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext__bindgen_ty_1>())).fpstate as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigcontext__bindgen_ty_1 ) , "::" , stringify ! ( fpstate ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext__bindgen_ty_1>())).__fpstate_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigcontext__bindgen_ty_1 ) , "::" , stringify ! ( __fpstate_word ) ));
}

#[test]
fn bindgen_test_layout_sigcontext() {
    assert_eq!(::std::mem::size_of::<sigcontext>(), 256usize, concat!( "Size of: " , stringify ! ( sigcontext ) ));
    assert_eq!(::std::mem::align_of::<sigcontext>(), 8usize, concat!( "Alignment of " , stringify ! ( sigcontext ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).r8 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( r8 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).r9 as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( r9 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).r10 as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( r10 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).r11 as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( r11 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).r12 as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( r12 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).r13 as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( r13 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).r14 as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( r14 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).r15 as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( r15 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rdi as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rdi ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rsi as *const _ as usize }, 72usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rsi ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rbp as *const _ as usize }, 80usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rbp ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rbx as *const _ as usize }, 88usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rbx ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rdx as *const _ as usize }, 96usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rdx ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rax as *const _ as usize }, 104usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rax ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rcx as *const _ as usize }, 112usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rcx ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rsp as *const _ as usize }, 120usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rsp ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).rip as *const _ as usize }, 128usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( rip ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).eflags as *const _ as usize }, 136usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( eflags ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).cs as *const _ as usize }, 144usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( cs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).gs as *const _ as usize }, 146usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( gs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).fs as *const _ as usize }, 148usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( fs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).__pad0 as *const _ as usize }, 150usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( __pad0 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).err as *const _ as usize }, 152usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( err ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).trapno as *const _ as usize }, 160usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( trapno ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).oldmask as *const _ as usize }, 168usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( oldmask ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).cr2 as *const _ as usize }, 176usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( cr2 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigcontext>())).__reserved1 as *const _ as usize }, 192usize, concat!( "Offset of field: " , stringify ! ( sigcontext ) , "::" , stringify ! ( __reserved1 ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xsave_hdr { pub xstate_bv: __uint64_t, pub reserved1: [__uint64_t; 2usize], pub reserved2: [__uint64_t; 5usize] }

#[test]
fn bindgen_test_layout__xsave_hdr() {
    assert_eq!(::std::mem::size_of::<_xsave_hdr>(), 64usize, concat!( "Size of: " , stringify ! ( _xsave_hdr ) ));
    assert_eq!(::std::mem::align_of::<_xsave_hdr>(), 8usize, concat!( "Alignment of " , stringify ! ( _xsave_hdr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_xsave_hdr>())).xstate_bv as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _xsave_hdr ) , "::" , stringify ! ( xstate_bv ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_xsave_hdr>())).reserved1 as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _xsave_hdr ) , "::" , stringify ! ( reserved1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_xsave_hdr>())).reserved2 as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( _xsave_hdr ) , "::" , stringify ! ( reserved2 ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ymmh_state { pub ymmh_space: [__uint32_t; 64usize] }

#[test]
fn bindgen_test_layout__ymmh_state() {
    assert_eq!(::std::mem::size_of::<_ymmh_state>(), 256usize, concat!( "Size of: " , stringify ! ( _ymmh_state ) ));
    assert_eq!(::std::mem::align_of::<_ymmh_state>(), 4usize, concat!( "Alignment of " , stringify ! ( _ymmh_state ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_ymmh_state>())).ymmh_space as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _ymmh_state ) , "::" , stringify ! ( ymmh_space ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct _xstate { pub fpstate: _fpstate, pub xstate_hdr: _xsave_hdr, pub ymmh: _ymmh_state }

#[test]
fn bindgen_test_layout__xstate() {
    assert_eq!(::std::mem::size_of::<_xstate>(), 832usize, concat!( "Size of: " , stringify ! ( _xstate ) ));
    assert_eq!(::std::mem::align_of::<_xstate>(), 8usize, concat!( "Alignment of " , stringify ! ( _xstate ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_xstate>())).fpstate as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _xstate ) , "::" , stringify ! ( fpstate ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_xstate>())).xstate_hdr as *const _ as usize }, 512usize, concat!( "Offset of field: " , stringify ! ( _xstate ) , "::" , stringify ! ( xstate_hdr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_xstate>())).ymmh as *const _ as usize }, 576usize, concat!( "Offset of field: " , stringify ! ( _xstate ) , "::" , stringify ! ( ymmh ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigstack { pub ss_sp: *mut ::libc::c_void, pub ss_onstack: ::libc::c_int }

#[test]
fn bindgen_test_layout_sigstack() {
    assert_eq!(::std::mem::size_of::<sigstack>(), 16usize, concat!( "Size of: " , stringify ! ( sigstack ) ));
    assert_eq!(::std::mem::align_of::<sigstack>(), 8usize, concat!( "Alignment of " , stringify ! ( sigstack ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigstack>())).ss_sp as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigstack ) , "::" , stringify ! ( ss_sp ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigstack>())).ss_onstack as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( sigstack ) , "::" , stringify ! ( ss_onstack ) ));
}

pub const SS_ONSTACK: _bindgen_ty_12 = 1;
pub const SS_DISABLE: _bindgen_ty_12 = 2;

pub type _bindgen_ty_12 = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigaltstack { pub ss_sp: *mut ::libc::c_void, pub ss_flags: ::libc::c_int, pub ss_size: usize }

#[test]
fn bindgen_test_layout_sigaltstack() {
    assert_eq!(::std::mem::size_of::<sigaltstack>(), 24usize, concat!( "Size of: " , stringify ! ( sigaltstack ) ));
    assert_eq!(::std::mem::align_of::<sigaltstack>(), 8usize, concat!( "Alignment of " , stringify ! ( sigaltstack ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaltstack>())).ss_sp as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sigaltstack ) , "::" , stringify ! ( ss_sp ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaltstack>())).ss_flags as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( sigaltstack ) , "::" , stringify ! ( ss_flags ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sigaltstack>())).ss_size as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( sigaltstack ) , "::" , stringify ! ( ss_size ) ));
}

pub type stack_t = sigaltstack;
pub type greg_t = ::libc::c_longlong;
pub type gregset_t = [greg_t; 23usize];

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _libc_fpxreg { pub significand: [::libc::c_ushort; 4usize], pub exponent: ::libc::c_ushort, pub padding: [::libc::c_ushort; 3usize] }

#[test]
fn bindgen_test_layout__libc_fpxreg() {
    assert_eq!(::std::mem::size_of::<_libc_fpxreg>(), 16usize, concat!( "Size of: " , stringify ! ( _libc_fpxreg ) ));
    assert_eq!(::std::mem::align_of::<_libc_fpxreg>(), 2usize, concat!( "Alignment of " , stringify ! ( _libc_fpxreg ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpxreg>())).significand as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _libc_fpxreg ) , "::" , stringify ! ( significand ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpxreg>())).exponent as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _libc_fpxreg ) , "::" , stringify ! ( exponent ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpxreg>())).padding as *const _ as usize }, 10usize, concat!( "Offset of field: " , stringify ! ( _libc_fpxreg ) , "::" , stringify ! ( padding ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _libc_xmmreg { pub element: [__uint32_t; 4usize] }

#[test]
fn bindgen_test_layout__libc_xmmreg() {
    assert_eq!(::std::mem::size_of::<_libc_xmmreg>(), 16usize, concat!( "Size of: " , stringify ! ( _libc_xmmreg ) ));
    assert_eq!(::std::mem::align_of::<_libc_xmmreg>(), 4usize, concat!( "Alignment of " , stringify ! ( _libc_xmmreg ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_xmmreg>())).element as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _libc_xmmreg ) , "::" , stringify ! ( element ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _libc_fpstate { pub cwd: __uint16_t, pub swd: __uint16_t, pub ftw: __uint16_t, pub fop: __uint16_t, pub rip: __uint64_t, pub rdp: __uint64_t, pub mxcsr: __uint32_t, pub mxcr_mask: __uint32_t, pub _st: [_libc_fpxreg; 8usize], pub _xmm: [_libc_xmmreg; 16usize], pub padding: [__uint32_t; 24usize] }

#[test]
fn bindgen_test_layout__libc_fpstate() {
    assert_eq!(::std::mem::size_of::<_libc_fpstate>(), 512usize, concat!( "Size of: " , stringify ! ( _libc_fpstate ) ));
    assert_eq!(::std::mem::align_of::<_libc_fpstate>(), 8usize, concat!( "Alignment of " , stringify ! ( _libc_fpstate ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).cwd as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( cwd ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).swd as *const _ as usize }, 2usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( swd ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).ftw as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( ftw ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).fop as *const _ as usize }, 6usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( fop ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).rip as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( rip ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).rdp as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( rdp ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).mxcsr as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( mxcsr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).mxcr_mask as *const _ as usize }, 28usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( mxcr_mask ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>()))._st as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( _st ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>()))._xmm as *const _ as usize }, 160usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( _xmm ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_libc_fpstate>())).padding as *const _ as usize }, 416usize, concat!( "Offset of field: " , stringify ! ( _libc_fpstate ) , "::" , stringify ! ( padding ) ));
}

pub type fpregset_t = *mut _libc_fpstate;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcontext_t { pub gregs: gregset_t, pub fpregs: fpregset_t, pub __reserved1: [::libc::c_ulonglong; 8usize] }

#[test]
fn bindgen_test_layout_mcontext_t() {
    assert_eq!(::std::mem::size_of::<mcontext_t>(), 256usize, concat!( "Size of: " , stringify ! ( mcontext_t ) ));
    assert_eq!(::std::mem::align_of::<mcontext_t>(), 8usize, concat!( "Alignment of " , stringify ! ( mcontext_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<mcontext_t>())).gregs as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( mcontext_t ) , "::" , stringify ! ( gregs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<mcontext_t>())).fpregs as *const _ as usize }, 184usize, concat!( "Offset of field: " , stringify ! ( mcontext_t ) , "::" , stringify ! ( fpregs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<mcontext_t>())).__reserved1 as *const _ as usize }, 192usize, concat!( "Offset of field: " , stringify ! ( mcontext_t ) , "::" , stringify ! ( __reserved1 ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucontext { pub uc_flags: ::libc::c_ulong, pub uc_link: *mut ucontext, pub uc_stack: stack_t, pub uc_mcontext: mcontext_t, pub uc_sigmask: __sigset_t, pub __fpregs_mem: _libc_fpstate }

#[test]
fn bindgen_test_layout_ucontext() {
    assert_eq!(::std::mem::size_of::<ucontext>(), 936usize, concat!( "Size of: " , stringify ! ( ucontext ) ));
    assert_eq!(::std::mem::align_of::<ucontext>(), 8usize, concat!( "Alignment of " , stringify ! ( ucontext ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ucontext>())).uc_flags as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ucontext ) , "::" , stringify ! ( uc_flags ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ucontext>())).uc_link as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ucontext ) , "::" , stringify ! ( uc_link ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ucontext>())).uc_stack as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( ucontext ) , "::" , stringify ! ( uc_stack ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ucontext>())).uc_mcontext as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( ucontext ) , "::" , stringify ! ( uc_mcontext ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ucontext>())).uc_sigmask as *const _ as usize }, 296usize, concat!( "Offset of field: " , stringify ! ( ucontext ) , "::" , stringify ! ( uc_sigmask ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ucontext>())).__fpregs_mem as *const _ as usize }, 424usize, concat!( "Offset of field: " , stringify ! ( ucontext ) , "::" , stringify ! ( __fpregs_mem ) ));
}

pub type ucontext_t = ucontext;

pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;

pub type idtype_t = u32;

#[repr(C)]
#[derive(Copy, Clone)]
pub union __WAIT_STATUS { pub __uptr: *mut wait, pub __iptr: *mut ::libc::c_int, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout___WAIT_STATUS() {
    assert_eq!(::std::mem::size_of::<__WAIT_STATUS>(), 8usize, concat!( "Size of: " , stringify ! ( __WAIT_STATUS ) ));
    assert_eq!(::std::mem::align_of::<__WAIT_STATUS>(), 8usize, concat!( "Alignment of " , stringify ! ( __WAIT_STATUS ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__WAIT_STATUS>())).__uptr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __WAIT_STATUS ) , "::" , stringify ! ( __uptr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__WAIT_STATUS>())).__iptr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __WAIT_STATUS ) , "::" , stringify ! ( __iptr ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union wait { pub w_status: ::libc::c_int, pub __wait_terminated: wait__bindgen_ty_1, pub __wait_stopped: wait__bindgen_ty_2, _bindgen_union_align: u32 }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_1 { pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>, pub __bindgen_align: [u32; 0usize] }

#[test]
fn bindgen_test_layout_wait__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<wait__bindgen_ty_1>(), 4usize, concat!( "Size of: " , stringify ! ( wait__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<wait__bindgen_ty_1>(), 4usize, concat!( "Alignment of " , stringify ! ( wait__bindgen_ty_1 ) ));
}

impl wait__bindgen_ty_1 {
    #[inline]
    pub fn __w_termsig(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u32) } }
    #[inline]
    pub fn set___w_termsig(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn __w_coredump(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) } }
    #[inline]
    pub fn set___w_coredump(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn __w_retcode(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) } }
    #[inline]
    pub fn set___w_retcode(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(__w_termsig: ::libc::c_uint, __w_coredump: ::libc::c_uint, __w_retcode: ::libc::c_uint) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let __w_termsig: u32 = unsafe { ::std::mem::transmute(__w_termsig) };
            __w_termsig as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let __w_coredump: u32 = unsafe { ::std::mem::transmute(__w_coredump) };
            __w_coredump as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let __w_retcode: u32 = unsafe { ::std::mem::transmute(__w_retcode) };
            __w_retcode as u64
        });
        __bindgen_bitfield_unit
    }
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_2 { pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>, pub __bindgen_align: [u32; 0usize] }

#[test]
fn bindgen_test_layout_wait__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<wait__bindgen_ty_2>(), 4usize, concat!( "Size of: " , stringify ! ( wait__bindgen_ty_2 ) ));
    assert_eq!(::std::mem::align_of::<wait__bindgen_ty_2>(), 4usize, concat!( "Alignment of " , stringify ! ( wait__bindgen_ty_2 ) ));
}

impl wait__bindgen_ty_2 {
    #[inline]
    pub fn __w_stopval(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) } }
    #[inline]
    pub fn set___w_stopval(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __w_stopsig(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) } }
    #[inline]
    pub fn set___w_stopsig(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(__w_stopval: ::libc::c_uint, __w_stopsig: ::libc::c_uint) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let __w_stopval: u32 = unsafe { ::std::mem::transmute(__w_stopval) };
            __w_stopval as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let __w_stopsig: u32 = unsafe { ::std::mem::transmute(__w_stopsig) };
            __w_stopsig as u64
        });
        __bindgen_bitfield_unit
    }
}

#[test]
fn bindgen_test_layout_wait() {
    assert_eq!(::std::mem::size_of::<wait>(), 4usize, concat!( "Size of: " , stringify ! ( wait ) ));
    assert_eq!(::std::mem::align_of::<wait>(), 4usize, concat!( "Alignment of " , stringify ! ( wait ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<wait>())).w_status as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( wait ) , "::" , stringify ! ( w_status ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<wait>())).__wait_terminated as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( wait ) , "::" , stringify ! ( __wait_terminated ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<wait>())).__wait_stopped as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( wait ) , "::" , stringify ! ( __wait_stopped ) ));
}

pub type apr_byte_t = ::libc::c_uchar;
pub type apr_int16_t = ::libc::c_short;
pub type apr_uint16_t = ::libc::c_ushort;
pub type apr_int32_t = ::libc::c_int;
pub type apr_uint32_t = ::libc::c_uint;
pub type apr_int64_t = ::libc::c_long;
pub type apr_uint64_t = ::libc::c_ulong;
pub type apr_size_t = usize;
pub type apr_ssize_t = isize;
pub type apr_off_t = off_t;
pub type apr_socklen_t = socklen_t;
pub type apr_ino_t = ino_t;
pub type apr_uintptr_t = apr_uint64_t;
/// Type for specifying an error or status code.
pub type apr_status_t = ::libc::c_int;
/// signal numbers typedef
pub type apr_signum_t = ::libc::c_int;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct { pub __locales: [*mut __locale_data; 13usize], pub __ctype_b: *const ::libc::c_ushort, pub __ctype_tolower: *const ::libc::c_int, pub __ctype_toupper: *const ::libc::c_int, pub __names: [*const ::libc::c_char; 13usize] }

#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(::std::mem::size_of::<__locale_struct>(), 232usize, concat!( "Size of: " , stringify ! ( __locale_struct ) ));
    assert_eq!(::std::mem::align_of::<__locale_struct>(), 8usize, concat!( "Alignment of " , stringify ! ( __locale_struct ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __locales ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize }, 104usize, concat!( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_b ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize }, 112usize, concat!( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_tolower ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize }, 120usize, concat!( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_toupper ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize }, 128usize, concat!( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __names ) ));
}

pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_pool_t { _unused: [u8; 0] }

/// A function that is called when allocation fails.
pub type apr_abortfunc_t = ::std::option::Option<unsafe extern "C" fn(retcode: ::libc::c_int) -> ::libc::c_int>;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_allocator_t { _unused: [u8; 0] }

/// basic memory node structure
/// @note The next, ref and first_avail fields are available for use by the
/// caller of apr_allocator_alloc(), the remaining fields are read-only.
/// The next field has to be used with caution and sensibly set when the
/// memnode is passed back to apr_allocator_free().  See apr_allocator_free()
/// for details.
/// The ref and first_avail fields will be properly restored by
/// apr_allocator_free().
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_memnode_t {
    /// < next memnode
    pub next: *mut apr_memnode_t,
    /// < reference to self
    pub ref_: *mut *mut apr_memnode_t,
    /// < size
    pub index: apr_uint32_t,
    /// < how much free
    pub free_index: apr_uint32_t,
    /// < pointer to first free memory
    pub first_avail: *mut ::libc::c_char,
    /// < pointer to end of free memory
    pub endp: *mut ::libc::c_char,
}

#[test]
fn bindgen_test_layout_apr_memnode_t() {
    assert_eq!(::std::mem::size_of::<apr_memnode_t>(), 40usize, concat!( "Size of: " , stringify ! ( apr_memnode_t ) ));
    assert_eq!(::std::mem::align_of::<apr_memnode_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_memnode_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_memnode_t>())).next as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_memnode_t ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_memnode_t>())).ref_ as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_memnode_t ) , "::" , stringify ! ( ref_ ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_memnode_t>())).index as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_memnode_t ) , "::" , stringify ! ( index ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_memnode_t>())).free_index as *const _ as usize }, 20usize, concat!( "Offset of field: " , stringify ! ( apr_memnode_t ) , "::" , stringify ! ( free_index ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_memnode_t>())).first_avail as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_memnode_t ) , "::" , stringify ! ( first_avail ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_memnode_t>())).endp as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( apr_memnode_t ) , "::" , stringify ! ( endp ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_thread_mutex_t { _unused: [u8; 0] }

pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_table_t { _unused: [u8; 0] }

/// An opaque array type
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_array_header_t {
    /// The pool the array is allocated out of
    pub pool: *mut apr_pool_t,
    /// The amount of memory allocated for each element of the array
    pub elt_size: ::libc::c_int,
    /// The number of active elements in the array
    pub nelts: ::libc::c_int,
    /// The number of elements allocated in the array
    pub nalloc: ::libc::c_int,
    /// The elements in the array
    pub elts: *mut ::libc::c_char,
}

#[test]
fn bindgen_test_layout_apr_array_header_t() {
    assert_eq!(::std::mem::size_of::<apr_array_header_t>(), 32usize, concat!( "Size of: " , stringify ! ( apr_array_header_t ) ));
    assert_eq!(::std::mem::align_of::<apr_array_header_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_array_header_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).pool as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).elt_size as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( elt_size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).nelts as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( nelts ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).nalloc as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( nalloc ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_array_header_t>())).elts as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_array_header_t ) , "::" , stringify ! ( elts ) ));
}

/// The type for each entry in a string-content table
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_table_entry_t {
    /// The key for the current table entry
    pub key: *mut ::libc::c_char,
    /// The value for the current table entry
    pub val: *mut ::libc::c_char,
    /// A checksum for the key, for use by the apr_table internals
    pub key_checksum: apr_uint32_t,
}

#[test]
fn bindgen_test_layout_apr_table_entry_t() {
    assert_eq!(::std::mem::size_of::<apr_table_entry_t>(), 24usize, concat!( "Size of: " , stringify ! ( apr_table_entry_t ) ));
    assert_eq!(::std::mem::align_of::<apr_table_entry_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_table_entry_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_table_entry_t>())).key as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_table_entry_t ) , "::" , stringify ! ( key ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_table_entry_t>())).val as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_table_entry_t ) , "::" , stringify ! ( val ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_table_entry_t>())).key_checksum as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_table_entry_t ) , "::" , stringify ! ( key_checksum ) ));
}

/// Declaration prototype for the iterator callback function of apr_table_do()
/// and apr_table_vdo().
/// @param rec The data passed as the first argument to apr_table_[v]do()
/// @param key The key from this iteration of the table
/// @param value The value from this iteration of the table
/// @remark Iteration continues while this callback function returns non-zero.
/// To export the callback function for apr_table_[v]do() it must be declared
/// in the _NONSTD convention.
pub type apr_table_do_callback_fn_t = ::std::option::Option<unsafe extern "C" fn(rec: *mut ::libc::c_void, key: *const ::libc::c_char, value: *const ::libc::c_char) -> ::libc::c_int>;

extern "C" {
    #[link_name = "\u{1}apr_hook_global_pool"]
    pub static mut apr_hook_global_pool: *mut apr_pool_t;
}

extern "C" {
    #[link_name = "\u{1}apr_hook_debug_enabled"]
    pub static mut apr_hook_debug_enabled: ::libc::c_int;
}

extern "C" {
    #[link_name = "\u{1}apr_hook_debug_current"]
    pub static mut apr_hook_debug_current: *const ::libc::c_char;
}

extern "C" {
    #[link_name = "\u{1}apr_month_snames"]
    pub static mut apr_month_snames: [[::libc::c_char; 4usize]; 12usize];
}

extern "C" {
    #[link_name = "\u{1}apr_day_snames"]
    pub static mut apr_day_snames: [[::libc::c_char; 4usize]; 7usize];
}

/// number of microseconds since 00:00:00 january 1, 1970 UTC
pub type apr_time_t = apr_int64_t;
/// intervals for I/O timeouts, in microseconds
pub type apr_interval_time_t = apr_int64_t;
/// short interval for I/O timeouts, in microseconds
pub type apr_short_interval_time_t = apr_int32_t;

/// a structure similar to ANSI struct tm with the following differences:
/// - tm_usec isn't an ANSI field
/// - tm_gmtoff isn't an ANSI field (it's a bsdism)
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_time_exp_t {
    /// microseconds past tm_sec
    pub tm_usec: apr_int32_t,
    /// (0-61) seconds past tm_min
    pub tm_sec: apr_int32_t,
    /// (0-59) minutes past tm_hour
    pub tm_min: apr_int32_t,
    /// (0-23) hours past midnight
    pub tm_hour: apr_int32_t,
    /// (1-31) day of the month
    pub tm_mday: apr_int32_t,
    /// (0-11) month of the year
    pub tm_mon: apr_int32_t,
    /// year since 1900
    pub tm_year: apr_int32_t,
    /// (0-6) days since sunday
    pub tm_wday: apr_int32_t,
    /// (0-365) days since jan 1
    pub tm_yday: apr_int32_t,
    /// daylight saving time
    pub tm_isdst: apr_int32_t,
    /// seconds east of UTC
    pub tm_gmtoff: apr_int32_t,
}

#[test]
fn bindgen_test_layout_apr_time_exp_t() {
    assert_eq!(::std::mem::size_of::<apr_time_exp_t>(), 44usize, concat!( "Size of: " , stringify ! ( apr_time_exp_t ) ));
    assert_eq!(::std::mem::align_of::<apr_time_exp_t>(), 4usize, concat!( "Alignment of " , stringify ! ( apr_time_exp_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_usec as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_usec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_sec as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_sec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_min as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_min ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_hour as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_hour ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_mday as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_mday ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_mon as *const _ as usize }, 20usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_mon ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_year as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_year ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_wday as *const _ as usize }, 28usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_wday ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_yday as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_yday ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_isdst as *const _ as usize }, 36usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_isdst ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_time_exp_t>())).tm_gmtoff as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( apr_time_exp_t ) , "::" , stringify ! ( tm_gmtoff ) ));
}

pub type apr_uid_t = uid_t;
pub type apr_gid_t = gid_t;

/// < no file type determined
pub const apr_filetype_e_APR_NOFILE: apr_filetype_e = 0;
/// < a regular file
pub const apr_filetype_e_APR_REG: apr_filetype_e = 1;
/// < a directory
pub const apr_filetype_e_APR_DIR: apr_filetype_e = 2;
/// < a character device
pub const apr_filetype_e_APR_CHR: apr_filetype_e = 3;
/// < a block device
pub const apr_filetype_e_APR_BLK: apr_filetype_e = 4;
/// < a FIFO / pipe
pub const apr_filetype_e_APR_PIPE: apr_filetype_e = 5;
/// < a symbolic link
pub const apr_filetype_e_APR_LNK: apr_filetype_e = 6;
/// < a [unix domain] socket
pub const apr_filetype_e_APR_SOCK: apr_filetype_e = 7;
/// < a file of some other unknown type
pub const apr_filetype_e_APR_UNKFILE: apr_filetype_e = 127;

/// apr_filetype_e values for the filetype member of the
/// apr_file_info_t structure
/// @warning: Not all of the filetypes below can be determined.
/// For example, a given platform might not correctly report
/// a socket descriptor as APR_SOCK if that type isn't
/// well-identified on that platform.  In such cases where
/// a filetype exists but cannot be described by the recognized
/// flags below, the filetype will be APR_UNKFILE.  If the
/// filetype member is not determined, the type will be APR_NOFILE.
pub type apr_filetype_e = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_dir_t { _unused: [u8; 0] }

/// Structure for determining file permissions.
pub type apr_fileperms_t = apr_int32_t;
/// Structure for determining the device the file is on.
pub type apr_dev_t = dev_t;

/// The file information structure.  This is analogous to the POSIX
/// stat structure.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_finfo_t {
    /// Allocates memory and closes lingering handles in the specified pool
    pub pool: *mut apr_pool_t,
    /// The bitmask describing valid fields of this apr_finfo_t structure
    /// including all available 'wanted' fields and potentially more
    pub valid: apr_int32_t,
    /// The access permissions of the file.  Mimics Unix access rights.
    pub protection: apr_fileperms_t,
    /// The type of file.  One of APR_REG, APR_DIR, APR_CHR, APR_BLK, APR_PIPE,
    /// APR_LNK or APR_SOCK.  If the type is undetermined, the value is APR_NOFILE.
    /// If the type cannot be determined, the value is APR_UNKFILE.
    pub filetype: apr_filetype_e,
    /// The user id that owns the file
    pub user: apr_uid_t,
    /// The group id that owns the file
    pub group: apr_gid_t,
    /// The inode of the file.
    pub inode: apr_ino_t,
    /// The id of the device the file is on.
    pub device: apr_dev_t,
    /// The number of hard links to the file.
    pub nlink: apr_int32_t,
    /// The size of the file
    pub size: apr_off_t,
    /// The storage size consumed by the file
    pub csize: apr_off_t,
    /// The time the file was last accessed
    pub atime: apr_time_t,
    /// The time the file was last modified
    pub mtime: apr_time_t,
    /// The time the file was created, or the inode was last changed
    pub ctime: apr_time_t,
    /// The pathname of the file (possibly unrooted)
    pub fname: *const ::libc::c_char,
    /// The file's name (no path) in filesystem case
    pub name: *const ::libc::c_char,
    /// The file's handle, if accessed (can be submitted to apr_duphandle)
    pub filehand: *mut apr_file_t,
}

#[test]
fn bindgen_test_layout_apr_finfo_t() {
    assert_eq!(::std::mem::size_of::<apr_finfo_t>(), 120usize, concat!( "Size of: " , stringify ! ( apr_finfo_t ) ));
    assert_eq!(::std::mem::align_of::<apr_finfo_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_finfo_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).pool as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).valid as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( valid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).protection as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( protection ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).filetype as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( filetype ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).user as *const _ as usize }, 20usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( user ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).group as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( group ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).inode as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( inode ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).device as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( device ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).nlink as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( nlink ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).size as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).csize as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( csize ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).atime as *const _ as usize }, 72usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( atime ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).mtime as *const _ as usize }, 80usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( mtime ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).ctime as *const _ as usize }, 88usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( ctime ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).fname as *const _ as usize }, 96usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( fname ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).name as *const _ as usize }, 104usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( name ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_finfo_t>())).filehand as *const _ as usize }, 112usize, concat!( "Offset of field: " , stringify ! ( apr_finfo_t ) , "::" , stringify ! ( filehand ) ));
}

pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t { pub __count: ::libc::c_int, pub __value: __mbstate_t__bindgen_ty_1 }

#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 { pub __wch: ::libc::c_uint, pub __wchb: [::libc::c_char; 4usize], _bindgen_union_align: u32 }

#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(), 4usize, concat!( "Size of: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(), 4usize, concat!( "Alignment of " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wch ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wchb ) ));
}

#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::std::mem::size_of::<__mbstate_t>(), 8usize, concat!( "Size of: " , stringify ! ( __mbstate_t ) ));
    assert_eq!(::std::mem::align_of::<__mbstate_t>(), 4usize, concat!( "Alignment of " , stringify ! ( __mbstate_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( __mbstate_t ) , "::" , stringify ! ( __count ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( __mbstate_t ) , "::" , stringify ! ( __value ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t { pub __pos: __off_t, pub __state: __mbstate_t }

#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos_t>(), 16usize, concat!( "Size of: " , stringify ! ( _G_fpos_t ) ));
    assert_eq!(::std::mem::align_of::<_G_fpos_t>(), 8usize, concat!( "Alignment of " , stringify ! ( _G_fpos_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _G_fpos_t ) , "::" , stringify ! ( __pos ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _G_fpos_t ) , "::" , stringify ! ( __state ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t { pub __pos: __off64_t, pub __state: __mbstate_t }

#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos64_t>(), 16usize, concat!( "Size of: " , stringify ! ( _G_fpos64_t ) ));
    assert_eq!(::std::mem::align_of::<_G_fpos64_t>(), 8usize, concat!( "Alignment of " , stringify ! ( _G_fpos64_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _G_fpos64_t ) , "::" , stringify ! ( __pos ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _G_fpos64_t ) , "::" , stringify ! ( __state ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t { _unused: [u8; 0] }

pub type _IO_lock_t = ::libc::c_void;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker { pub _next: *mut _IO_marker, pub _sbuf: *mut _IO_FILE, pub _pos: ::libc::c_int }

#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(::std::mem::size_of::<_IO_marker>(), 24usize, concat!( "Size of: " , stringify ! ( _IO_marker ) ));
    assert_eq!(::std::mem::align_of::<_IO_marker>(), 8usize, concat!( "Alignment of " , stringify ! ( _IO_marker ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_marker>()))._next as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _IO_marker ) , "::" , stringify ! ( _next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _IO_marker ) , "::" , stringify ! ( _sbuf ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_marker>()))._pos as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( _IO_marker ) , "::" , stringify ! ( _pos ) ));
}

pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;

pub type __codecvt_result = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE { pub _flags: ::libc::c_int, pub _IO_read_ptr: *mut ::libc::c_char, pub _IO_read_end: *mut ::libc::c_char, pub _IO_read_base: *mut ::libc::c_char, pub _IO_write_base: *mut ::libc::c_char, pub _IO_write_ptr: *mut ::libc::c_char, pub _IO_write_end: *mut ::libc::c_char, pub _IO_buf_base: *mut ::libc::c_char, pub _IO_buf_end: *mut ::libc::c_char, pub _IO_save_base: *mut ::libc::c_char, pub _IO_backup_base: *mut ::libc::c_char, pub _IO_save_end: *mut ::libc::c_char, pub _markers: *mut _IO_marker, pub _chain: *mut _IO_FILE, pub _fileno: ::libc::c_int, pub _flags2: ::libc::c_int, pub _old_offset: __off_t, pub _cur_column: ::libc::c_ushort, pub _vtable_offset: ::libc::c_schar, pub _shortbuf: [::libc::c_char; 1usize], pub _lock: *mut _IO_lock_t, pub _offset: __off64_t, pub __pad1: *mut ::libc::c_void, pub __pad2: *mut ::libc::c_void, pub __pad3: *mut ::libc::c_void, pub __pad4: *mut ::libc::c_void, pub __pad5: usize, pub _mode: ::libc::c_int, pub _unused2: [::libc::c_char; 20usize] }

#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(::std::mem::size_of::<_IO_FILE>(), 216usize, concat!( "Size of: " , stringify ! ( _IO_FILE ) ));
    assert_eq!(::std::mem::align_of::<_IO_FILE>(), 8usize, concat!( "Alignment of " , stringify ! ( _IO_FILE ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _flags ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_read_ptr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_read_end ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_read_base ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_write_base ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_write_ptr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_write_end ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_buf_base ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_buf_end ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize }, 72usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_save_base ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize }, 80usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_backup_base ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize }, 88usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_save_end ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize }, 96usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _markers ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize }, 104usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _chain ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize }, 112usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _fileno ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize }, 116usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _flags2 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize }, 120usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _old_offset ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize }, 128usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _cur_column ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize }, 130usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _vtable_offset ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize }, 131usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _shortbuf ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize }, 136usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _lock ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize }, 144usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _offset ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize }, 152usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( __pad1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize }, 160usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( __pad2 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize }, 168usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( __pad3 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize }, 176usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( __pad4 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize }, 184usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( __pad5 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize }, 192usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _mode ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize }, 196usize, concat!( "Offset of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _unused2 ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus { _unused: [u8; 0] }

extern "C" {
    #[link_name = "\u{1}_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}

extern "C" {
    #[link_name = "\u{1}_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}

extern "C" {
    #[link_name = "\u{1}_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}

pub type __io_read_fn = ::std::option::Option<unsafe extern "C" fn(__cookie: *mut ::libc::c_void, __buf: *mut ::libc::c_char, __nbytes: usize) -> __ssize_t>;
pub type __io_write_fn = ::std::option::Option<unsafe extern "C" fn(__cookie: *mut ::libc::c_void, __buf: *const ::libc::c_char, __n: usize) -> __ssize_t>;
pub type __io_seek_fn = ::std::option::Option<unsafe extern "C" fn(__cookie: *mut ::libc::c_void, __pos: *mut __off64_t, __w: ::libc::c_int) -> ::libc::c_int>;
pub type __io_close_fn = ::std::option::Option<unsafe extern "C" fn(__cookie: *mut ::libc::c_void) -> ::libc::c_int>;
pub type cookie_read_function_t = __io_read_fn;
pub type cookie_write_function_t = __io_write_fn;
pub type cookie_seek_function_t = __io_seek_fn;
pub type cookie_close_function_t = __io_close_fn;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t { pub read: __io_read_fn, pub write: __io_write_fn, pub seek: __io_seek_fn, pub close: __io_close_fn }

#[test]
fn bindgen_test_layout__IO_cookie_io_functions_t() {
    assert_eq!(::std::mem::size_of::<_IO_cookie_io_functions_t>(), 32usize, concat!( "Size of: " , stringify ! ( _IO_cookie_io_functions_t ) ));
    assert_eq!(::std::mem::align_of::<_IO_cookie_io_functions_t>(), 8usize, concat!( "Alignment of " , stringify ! ( _IO_cookie_io_functions_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_cookie_io_functions_t>())).read as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( _IO_cookie_io_functions_t ) , "::" , stringify ! ( read ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_cookie_io_functions_t>())).write as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( _IO_cookie_io_functions_t ) , "::" , stringify ! ( write ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_cookie_io_functions_t>())).seek as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( _IO_cookie_io_functions_t ) , "::" , stringify ! ( seek ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<_IO_cookie_io_functions_t>())).close as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( _IO_cookie_io_functions_t ) , "::" , stringify ! ( close ) ));
}

pub type cookie_io_functions_t = _IO_cookie_io_functions_t;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_file { _unused: [u8; 0] }

pub type fpos_t = _G_fpos_t;

extern "C" {
    #[link_name = "\u{1}stdin"]
    pub static mut stdin: *mut _IO_FILE;
}

extern "C" {
    #[link_name = "\u{1}stdout"]
    pub static mut stdout: *mut _IO_FILE;
}

extern "C" {
    #[link_name = "\u{1}stderr"]
    pub static mut stderr: *mut _IO_FILE;
}

extern "C" {
    #[link_name = "\u{1}sys_nerr"]
    pub static mut sys_nerr: ::libc::c_int;
}

extern "C" {
    #[link_name = "\u{1}sys_errlist"]
    pub static mut sys_errlist: [*const ::libc::c_char; 0usize];
}

/// File attributes
pub type apr_fileattrs_t = apr_uint32_t;
/// Type to pass as whence argument to apr_file_seek.
pub type apr_seek_where_t = ::libc::c_int;
pub type in_addr_t = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr { pub s_addr: in_addr_t }

#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(::std::mem::size_of::<in_addr>(), 4usize, concat!( "Size of: " , stringify ! ( in_addr ) ));
    assert_eq!(::std::mem::align_of::<in_addr>(), 4usize, concat!( "Alignment of " , stringify ! ( in_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<in_addr>())).s_addr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( in_addr ) , "::" , stringify ! ( s_addr ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip_opts { pub ip_dst: in_addr, pub ip_opts: [::libc::c_char; 40usize] }

#[test]
fn bindgen_test_layout_ip_opts() {
    assert_eq!(::std::mem::size_of::<ip_opts>(), 44usize, concat!( "Size of: " , stringify ! ( ip_opts ) ));
    assert_eq!(::std::mem::align_of::<ip_opts>(), 4usize, concat!( "Alignment of " , stringify ! ( ip_opts ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_opts>())).ip_dst as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ip_opts ) , "::" , stringify ! ( ip_dst ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_opts>())).ip_opts as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ip_opts ) , "::" , stringify ! ( ip_opts ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn { pub imr_multiaddr: in_addr, pub imr_address: in_addr, pub imr_ifindex: ::libc::c_int }

#[test]
fn bindgen_test_layout_ip_mreqn() {
    assert_eq!(::std::mem::size_of::<ip_mreqn>(), 12usize, concat!( "Size of: " , stringify ! ( ip_mreqn ) ));
    assert_eq!(::std::mem::align_of::<ip_mreqn>(), 4usize, concat!( "Alignment of " , stringify ! ( ip_mreqn ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_multiaddr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ip_mreqn ) , "::" , stringify ! ( imr_multiaddr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_address as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ip_mreqn ) , "::" , stringify ! ( imr_address ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_ifindex as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ip_mreqn ) , "::" , stringify ! ( imr_ifindex ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo { pub ipi_ifindex: ::libc::c_int, pub ipi_spec_dst: in_addr, pub ipi_addr: in_addr }

#[test]
fn bindgen_test_layout_in_pktinfo() {
    assert_eq!(::std::mem::size_of::<in_pktinfo>(), 12usize, concat!( "Size of: " , stringify ! ( in_pktinfo ) ));
    assert_eq!(::std::mem::align_of::<in_pktinfo>(), 4usize, concat!( "Alignment of " , stringify ! ( in_pktinfo ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_ifindex as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( in_pktinfo ) , "::" , stringify ! ( ipi_ifindex ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_spec_dst as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( in_pktinfo ) , "::" , stringify ! ( ipi_spec_dst ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_addr as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( in_pktinfo ) , "::" , stringify ! ( ipi_addr ) ));
}

pub const IPPROTO_IP: _bindgen_ty_13 = 0;
pub const IPPROTO_ICMP: _bindgen_ty_13 = 1;
pub const IPPROTO_IGMP: _bindgen_ty_13 = 2;
pub const IPPROTO_IPIP: _bindgen_ty_13 = 4;
pub const IPPROTO_TCP: _bindgen_ty_13 = 6;
pub const IPPROTO_EGP: _bindgen_ty_13 = 8;
pub const IPPROTO_PUP: _bindgen_ty_13 = 12;
pub const IPPROTO_UDP: _bindgen_ty_13 = 17;
pub const IPPROTO_IDP: _bindgen_ty_13 = 22;
pub const IPPROTO_TP: _bindgen_ty_13 = 29;
pub const IPPROTO_DCCP: _bindgen_ty_13 = 33;
pub const IPPROTO_IPV6: _bindgen_ty_13 = 41;
pub const IPPROTO_RSVP: _bindgen_ty_13 = 46;
pub const IPPROTO_GRE: _bindgen_ty_13 = 47;
pub const IPPROTO_ESP: _bindgen_ty_13 = 50;
pub const IPPROTO_AH: _bindgen_ty_13 = 51;
pub const IPPROTO_MTP: _bindgen_ty_13 = 92;
pub const IPPROTO_BEETPH: _bindgen_ty_13 = 94;
pub const IPPROTO_ENCAP: _bindgen_ty_13 = 98;
pub const IPPROTO_PIM: _bindgen_ty_13 = 103;
pub const IPPROTO_COMP: _bindgen_ty_13 = 108;
pub const IPPROTO_SCTP: _bindgen_ty_13 = 132;
pub const IPPROTO_UDPLITE: _bindgen_ty_13 = 136;
pub const IPPROTO_MPLS: _bindgen_ty_13 = 137;
pub const IPPROTO_RAW: _bindgen_ty_13 = 255;
pub const IPPROTO_MAX: _bindgen_ty_13 = 256;

pub type _bindgen_ty_13 = u32;

pub const IPPROTO_HOPOPTS: _bindgen_ty_14 = 0;
pub const IPPROTO_ROUTING: _bindgen_ty_14 = 43;
pub const IPPROTO_FRAGMENT: _bindgen_ty_14 = 44;
pub const IPPROTO_ICMPV6: _bindgen_ty_14 = 58;
pub const IPPROTO_NONE: _bindgen_ty_14 = 59;
pub const IPPROTO_DSTOPTS: _bindgen_ty_14 = 60;
pub const IPPROTO_MH: _bindgen_ty_14 = 135;

pub type _bindgen_ty_14 = u32;
pub type in_port_t = u16;

pub const IPPORT_ECHO: _bindgen_ty_15 = 7;
pub const IPPORT_DISCARD: _bindgen_ty_15 = 9;
pub const IPPORT_SYSTAT: _bindgen_ty_15 = 11;
pub const IPPORT_DAYTIME: _bindgen_ty_15 = 13;
pub const IPPORT_NETSTAT: _bindgen_ty_15 = 15;
pub const IPPORT_FTP: _bindgen_ty_15 = 21;
pub const IPPORT_TELNET: _bindgen_ty_15 = 23;
pub const IPPORT_SMTP: _bindgen_ty_15 = 25;
pub const IPPORT_TIMESERVER: _bindgen_ty_15 = 37;
pub const IPPORT_NAMESERVER: _bindgen_ty_15 = 42;
pub const IPPORT_WHOIS: _bindgen_ty_15 = 43;
pub const IPPORT_MTP: _bindgen_ty_15 = 57;
pub const IPPORT_TFTP: _bindgen_ty_15 = 69;
pub const IPPORT_RJE: _bindgen_ty_15 = 77;
pub const IPPORT_FINGER: _bindgen_ty_15 = 79;
pub const IPPORT_TTYLINK: _bindgen_ty_15 = 87;
pub const IPPORT_SUPDUP: _bindgen_ty_15 = 95;
pub const IPPORT_EXECSERVER: _bindgen_ty_15 = 512;
pub const IPPORT_LOGINSERVER: _bindgen_ty_15 = 513;
pub const IPPORT_CMDSERVER: _bindgen_ty_15 = 514;
pub const IPPORT_EFSSERVER: _bindgen_ty_15 = 520;
pub const IPPORT_BIFFUDP: _bindgen_ty_15 = 512;
pub const IPPORT_WHOSERVER: _bindgen_ty_15 = 513;
pub const IPPORT_ROUTESERVER: _bindgen_ty_15 = 520;
pub const IPPORT_RESERVED: _bindgen_ty_15 = 1024;
pub const IPPORT_USERRESERVED: _bindgen_ty_15 = 5000;

pub type _bindgen_ty_15 = u32;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr { pub __in6_u: in6_addr__bindgen_ty_1 }

#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 { pub __u6_addr8: [u8; 16usize], pub __u6_addr16: [u16; 8usize], pub __u6_addr32: [u32; 4usize], _bindgen_union_align: [u32; 4usize] }

#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<in6_addr__bindgen_ty_1>(), 16usize, concat!( "Size of: " , stringify ! ( in6_addr__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<in6_addr__bindgen_ty_1>(), 4usize, concat!( "Alignment of " , stringify ! ( in6_addr__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr8 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( in6_addr__bindgen_ty_1 ) , "::" , stringify ! ( __u6_addr8 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr16 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( in6_addr__bindgen_ty_1 ) , "::" , stringify ! ( __u6_addr16 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr32 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( in6_addr__bindgen_ty_1 ) , "::" , stringify ! ( __u6_addr32 ) ));
}

#[test]
fn bindgen_test_layout_in6_addr() {
    assert_eq!(::std::mem::size_of::<in6_addr>(), 16usize, concat!( "Size of: " , stringify ! ( in6_addr ) ));
    assert_eq!(::std::mem::align_of::<in6_addr>(), 4usize, concat!( "Alignment of " , stringify ! ( in6_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<in6_addr>())).__in6_u as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( in6_addr ) , "::" , stringify ! ( __in6_u ) ));
}

extern "C" {
    #[link_name = "\u{1}in6addr_any"]
    pub static mut in6addr_any: in6_addr;
}

extern "C" {
    #[link_name = "\u{1}in6addr_loopback"]
    pub static mut in6addr_loopback: in6_addr;
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in { pub sin_family: sa_family_t, pub sin_port: in_port_t, pub sin_addr: in_addr, pub sin_zero: [::libc::c_uchar; 8usize] }

#[test]
fn bindgen_test_layout_sockaddr_in() {
    assert_eq!(::std::mem::size_of::<sockaddr_in>(), 16usize, concat!( "Size of: " , stringify ! ( sockaddr_in ) ));
    assert_eq!(::std::mem::align_of::<sockaddr_in>(), 4usize, concat!( "Alignment of " , stringify ! ( sockaddr_in ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_family as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in ) , "::" , stringify ! ( sin_family ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_port as *const _ as usize }, 2usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in ) , "::" , stringify ! ( sin_port ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_addr as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in ) , "::" , stringify ! ( sin_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_zero as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in ) , "::" , stringify ! ( sin_zero ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 { pub sin6_family: sa_family_t, pub sin6_port: in_port_t, pub sin6_flowinfo: u32, pub sin6_addr: in6_addr, pub sin6_scope_id: u32 }

#[test]
fn bindgen_test_layout_sockaddr_in6() {
    assert_eq!(::std::mem::size_of::<sockaddr_in6>(), 28usize, concat!( "Size of: " , stringify ! ( sockaddr_in6 ) ));
    assert_eq!(::std::mem::align_of::<sockaddr_in6>(), 4usize, concat!( "Alignment of " , stringify ! ( sockaddr_in6 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_family as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in6 ) , "::" , stringify ! ( sin6_family ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_port as *const _ as usize }, 2usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in6 ) , "::" , stringify ! ( sin6_port ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_flowinfo as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in6 ) , "::" , stringify ! ( sin6_flowinfo ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_addr as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in6 ) , "::" , stringify ! ( sin6_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_scope_id as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( sockaddr_in6 ) , "::" , stringify ! ( sin6_scope_id ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq { pub imr_multiaddr: in_addr, pub imr_interface: in_addr }

#[test]
fn bindgen_test_layout_ip_mreq() {
    assert_eq!(::std::mem::size_of::<ip_mreq>(), 8usize, concat!( "Size of: " , stringify ! ( ip_mreq ) ));
    assert_eq!(::std::mem::align_of::<ip_mreq>(), 4usize, concat!( "Alignment of " , stringify ! ( ip_mreq ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_mreq>())).imr_multiaddr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ip_mreq ) , "::" , stringify ! ( imr_multiaddr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_mreq>())).imr_interface as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ip_mreq ) , "::" , stringify ! ( imr_interface ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq_source { pub imr_multiaddr: in_addr, pub imr_interface: in_addr, pub imr_sourceaddr: in_addr }

#[test]
fn bindgen_test_layout_ip_mreq_source() {
    assert_eq!(::std::mem::size_of::<ip_mreq_source>(), 12usize, concat!( "Size of: " , stringify ! ( ip_mreq_source ) ));
    assert_eq!(::std::mem::align_of::<ip_mreq_source>(), 4usize, concat!( "Alignment of " , stringify ! ( ip_mreq_source ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_multiaddr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ip_mreq_source ) , "::" , stringify ! ( imr_multiaddr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_interface as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ip_mreq_source ) , "::" , stringify ! ( imr_interface ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_sourceaddr as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ip_mreq_source ) , "::" , stringify ! ( imr_sourceaddr ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq { pub ipv6mr_multiaddr: in6_addr, pub ipv6mr_interface: ::libc::c_uint }

#[test]
fn bindgen_test_layout_ipv6_mreq() {
    assert_eq!(::std::mem::size_of::<ipv6_mreq>(), 20usize, concat!( "Size of: " , stringify ! ( ipv6_mreq ) ));
    assert_eq!(::std::mem::align_of::<ipv6_mreq>(), 4usize, concat!( "Alignment of " , stringify ! ( ipv6_mreq ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_multiaddr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ipv6_mreq ) , "::" , stringify ! ( ipv6mr_multiaddr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_interface as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( ipv6_mreq ) , "::" , stringify ! ( ipv6mr_interface ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_req { pub gr_interface: u32, pub gr_group: sockaddr_storage }

#[test]
fn bindgen_test_layout_group_req() {
    assert_eq!(::std::mem::size_of::<group_req>(), 136usize, concat!( "Size of: " , stringify ! ( group_req ) ));
    assert_eq!(::std::mem::align_of::<group_req>(), 8usize, concat!( "Alignment of " , stringify ! ( group_req ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_req>())).gr_interface as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( group_req ) , "::" , stringify ! ( gr_interface ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_req>())).gr_group as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( group_req ) , "::" , stringify ! ( gr_group ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_source_req { pub gsr_interface: u32, pub gsr_group: sockaddr_storage, pub gsr_source: sockaddr_storage }

#[test]
fn bindgen_test_layout_group_source_req() {
    assert_eq!(::std::mem::size_of::<group_source_req>(), 264usize, concat!( "Size of: " , stringify ! ( group_source_req ) ));
    assert_eq!(::std::mem::align_of::<group_source_req>(), 8usize, concat!( "Alignment of " , stringify ! ( group_source_req ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_interface as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( group_source_req ) , "::" , stringify ! ( gsr_interface ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_group as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( group_source_req ) , "::" , stringify ! ( gsr_group ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_source as *const _ as usize }, 136usize, concat!( "Offset of field: " , stringify ! ( group_source_req ) , "::" , stringify ! ( gsr_source ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_msfilter { pub imsf_multiaddr: in_addr, pub imsf_interface: in_addr, pub imsf_fmode: u32, pub imsf_numsrc: u32, pub imsf_slist: [in_addr; 1usize] }

#[test]
fn bindgen_test_layout_ip_msfilter() {
    assert_eq!(::std::mem::size_of::<ip_msfilter>(), 20usize, concat!( "Size of: " , stringify ! ( ip_msfilter ) ));
    assert_eq!(::std::mem::align_of::<ip_msfilter>(), 4usize, concat!( "Alignment of " , stringify ! ( ip_msfilter ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_multiaddr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ip_msfilter ) , "::" , stringify ! ( imsf_multiaddr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_interface as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ip_msfilter ) , "::" , stringify ! ( imsf_interface ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_fmode as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ip_msfilter ) , "::" , stringify ! ( imsf_fmode ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_numsrc as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( ip_msfilter ) , "::" , stringify ! ( imsf_numsrc ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_slist as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( ip_msfilter ) , "::" , stringify ! ( imsf_slist ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_filter { pub gf_interface: u32, pub gf_group: sockaddr_storage, pub gf_fmode: u32, pub gf_numsrc: u32, pub gf_slist: [sockaddr_storage; 1usize] }

#[test]
fn bindgen_test_layout_group_filter() {
    assert_eq!(::std::mem::size_of::<group_filter>(), 272usize, concat!( "Size of: " , stringify ! ( group_filter ) ));
    assert_eq!(::std::mem::align_of::<group_filter>(), 8usize, concat!( "Alignment of " , stringify ! ( group_filter ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_filter>())).gf_interface as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( group_filter ) , "::" , stringify ! ( gf_interface ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_filter>())).gf_group as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( group_filter ) , "::" , stringify ! ( gf_group ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_filter>())).gf_fmode as *const _ as usize }, 136usize, concat!( "Offset of field: " , stringify ! ( group_filter ) , "::" , stringify ! ( gf_fmode ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_filter>())).gf_numsrc as *const _ as usize }, 140usize, concat!( "Offset of field: " , stringify ! ( group_filter ) , "::" , stringify ! ( gf_numsrc ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<group_filter>())).gf_slist as *const _ as usize }, 144usize, concat!( "Offset of field: " , stringify ! ( group_filter ) , "::" , stringify ! ( gf_slist ) ));
}

/// < no longer allow read request
pub const apr_shutdown_how_e_APR_SHUTDOWN_READ: apr_shutdown_how_e = 0;
/// < no longer allow write requests
pub const apr_shutdown_how_e_APR_SHUTDOWN_WRITE: apr_shutdown_how_e = 1;
/// < no longer allow read or write requests
pub const apr_shutdown_how_e_APR_SHUTDOWN_READWRITE: apr_shutdown_how_e = 2;

/// Define what type of socket shutdown should occur.
pub type apr_shutdown_how_e = u32;

/// < Socket information for local end of connection
pub const apr_interface_e_APR_LOCAL: apr_interface_e = 0;
/// < Socket information for remote end of connection
pub const apr_interface_e_APR_REMOTE: apr_interface_e = 1;

/// Enum used to denote either the local and remote endpoint of a
/// connection.
pub type apr_interface_e = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_socket_t { _unused: [u8; 0] }

/// A structure to represent in_addr
pub type apr_in_addr_t = in_addr;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_ipsubnet_t { _unused: [u8; 0] }

/// @remark use apr_uint16_t just in case some system has a short that isn't 16 bits...
pub type apr_port_t = apr_uint16_t;

/// APRs socket address type, used to ensure protocol independence
#[repr(C)]
#[derive(Copy, Clone)]
pub struct apr_sockaddr_t {
    /// The pool to use...
    pub pool: *mut apr_pool_t,
    /// The hostname
    pub hostname: *mut ::libc::c_char,
    /// Either a string of the port number or the service name for the port
    pub servname: *mut ::libc::c_char,
    /// The numeric port
    pub port: apr_port_t,
    /// The family
    pub family: apr_int32_t,
    /// How big is the sockaddr we're using?
    pub salen: apr_socklen_t,
    /// How big is the ip address structure we're using?
    pub ipaddr_len: ::libc::c_int,
    /// How big should the address buffer be?  16 for v4 or 46 for v6
    /// used in inet_ntop...
    pub addr_str_len: ::libc::c_int,
    /// This points to the IP address structure within the appropriate
    /// sockaddr structure.
    pub ipaddr_ptr: *mut ::libc::c_void,
    /// If multiple addresses were found by apr_sockaddr_info_get(), this
    /// points to a representation of the next address.
    pub next: *mut apr_sockaddr_t,
    pub sa: apr_sockaddr_sa_t,
}

/// Union of either IPv4 or IPv6 sockaddr.
#[repr(C)]
#[derive(Copy, Clone)]
pub union apr_sockaddr_sa_t {
    /// IPv4 sockaddr structure
    pub sin: sockaddr_in,
    /// IPv6 sockaddr structure
    pub sin6: sockaddr_in6,
    /// Placeholder to ensure that the size of this union is not
    /// dependent on whether APR_HAVE_IPV6 is defined.
    pub sas: sockaddr_storage,
    _bindgen_union_align: [u64; 16usize],
}

#[test]
fn bindgen_test_layout_apr_sockaddr_sa_t() {
    assert_eq!(::std::mem::size_of::<apr_sockaddr_sa_t>(), 128usize, concat!( "Size of: " , stringify ! ( apr_sockaddr_t__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<apr_sockaddr_sa_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_sockaddr_t__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_sa_t>())).sin as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t__bindgen_ty_1 ) , "::" , stringify ! ( sin ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_sa_t>())).sin6 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t__bindgen_ty_1 ) , "::" , stringify ! ( sin6 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_sa_t>())).sas as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t__bindgen_ty_1 ) , "::" , stringify ! ( sas ) ));
}

#[test]
fn bindgen_test_layout_apr_sockaddr_t() {
    assert_eq!(::std::mem::size_of::<apr_sockaddr_t>(), 192usize, concat!( "Size of: " , stringify ! ( apr_sockaddr_t ) ));
    assert_eq!(::std::mem::align_of::<apr_sockaddr_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_sockaddr_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).pool as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).hostname as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( hostname ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).servname as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( servname ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).port as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( port ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).family as *const _ as usize }, 28usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( family ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).salen as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( salen ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).ipaddr_len as *const _ as usize }, 36usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( ipaddr_len ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).addr_str_len as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( addr_str_len ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).ipaddr_ptr as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( ipaddr_ptr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).next as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_sockaddr_t>())).sa as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( apr_sockaddr_t ) , "::" , stringify ! ( sa ) ));
}

/// A structure to encapsulate headers and trailers for apr_socket_sendfile
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_hdtr_t {
    /// An iovec to store the headers sent before the file.
    pub headers: *mut iovec,
    /// number of headers in the iovec
    pub numheaders: ::libc::c_int,
    /// An iovec to store the trailers sent after the file.
    pub trailers: *mut iovec,
    /// number of trailers in the iovec
    pub numtrailers: ::libc::c_int,
}

#[test]
fn bindgen_test_layout_apr_hdtr_t() {
    assert_eq!(::std::mem::size_of::<apr_hdtr_t>(), 32usize, concat!( "Size of: " , stringify ! ( apr_hdtr_t ) ));
    assert_eq!(::std::mem::align_of::<apr_hdtr_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_hdtr_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_hdtr_t>())).headers as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_hdtr_t ) , "::" , stringify ! ( headers ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_hdtr_t>())).numheaders as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_hdtr_t ) , "::" , stringify ! ( numheaders ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_hdtr_t>())).trailers as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_hdtr_t ) , "::" , stringify ! ( trailers ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_hdtr_t>())).numtrailers as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_hdtr_t ) , "::" , stringify ! ( numtrailers ) ));
}

/// @remark
/// As far as I can tell the only really sane way to store an MMAP is as a
/// void * and a length.  BeOS requires this area_id, but that's just a little
/// something extra.  I am exposing this type, because it doesn't make much
/// sense to keep it private, and opening it up makes some stuff easier in
/// Apache.
/// /
/// /** The MMAP structure
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_mmap_t {
    /// The pool the mmap structure was allocated out of.
    pub cntxt: *mut apr_pool_t,
    /// The start of the memory mapped area
    pub mm: *mut ::libc::c_void,
    /// The amount of data in the mmap
    pub size: apr_size_t,
    /// ring of apr_mmap_t's that reference the same
    /// mmap'ed region; acts in place of a reference count
    pub link: apr_mmap_t__bindgen_ty_1,
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_mmap_t__bindgen_ty_1 { pub next: *mut apr_mmap_t, pub prev: *mut apr_mmap_t }

#[test]
fn bindgen_test_layout_apr_mmap_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<apr_mmap_t__bindgen_ty_1>(), 16usize, concat!( "Size of: " , stringify ! ( apr_mmap_t__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<apr_mmap_t__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_mmap_t__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_mmap_t__bindgen_ty_1>())).next as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_mmap_t__bindgen_ty_1 ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_mmap_t__bindgen_ty_1>())).prev as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_mmap_t__bindgen_ty_1 ) , "::" , stringify ! ( prev ) ));
}

#[test]
fn bindgen_test_layout_apr_mmap_t() {
    assert_eq!(::std::mem::size_of::<apr_mmap_t>(), 40usize, concat!( "Size of: " , stringify ! ( apr_mmap_t ) ));
    assert_eq!(::std::mem::align_of::<apr_mmap_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_mmap_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_mmap_t>())).cntxt as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_mmap_t ) , "::" , stringify ! ( cntxt ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_mmap_t>())).mm as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_mmap_t ) , "::" , stringify ! ( mm ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_mmap_t>())).size as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_mmap_t ) , "::" , stringify ! ( size ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_mmap_t>())).link as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_mmap_t ) , "::" , stringify ! ( link ) ));
}

/// < block until data becomes available
pub const apr_read_type_e_APR_BLOCK_READ: apr_read_type_e = 0;
/// < return immediately if no data is available
pub const apr_read_type_e_APR_NONBLOCK_READ: apr_read_type_e = 1;

/// Determines how a bucket or brigade should be read
pub type apr_read_type_e = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_alloc_t { _unused: [u8; 0] }

/// Basic bucket type
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_type_t {
    /// The name of the bucket type
    pub name: *const ::libc::c_char,
    /// The number of functions this bucket understands.  Can not be less than
    /// five.
    pub num_func: ::libc::c_int,
    pub is_metadata: apr_bucket_type_t__bindgen_ty_1,
    /// Free the private data and any resources used by the bucket (if they
    /// aren't shared with another bucket).  This function is required to be
    /// implemented for all bucket types, though it might be a no-op on some
    /// of them (namely ones that never allocate any private data structures).
    /// @param data The private data pointer from the bucket to be destroyed
    pub destroy: ::std::option::Option<unsafe extern "C" fn(data: *mut ::libc::c_void)>,
    /// Read the data from the bucket. This is required to be implemented
    /// for all bucket types.
    /// @param b The bucket to read from
    /// @param str A place to store the data read.  Allocation should only be
    /// done if absolutely necessary.
    /// @param len The amount of data read.
    /// @param block Should this read function block if there is more data that
    /// cannot be read immediately.
    pub read: ::std::option::Option<unsafe extern "C" fn(b: *mut apr_bucket, str: *mut *const ::libc::c_char, len: *mut apr_size_t, block: apr_read_type_e) -> apr_status_t>,
    /// Make it possible to set aside the data for at least as long as the
    /// given pool. Buckets containing data that could potentially die before
    /// this pool (e.g. the data resides on the stack, in a child pool of
    /// the given pool, or in a disjoint pool) must somehow copy, shift, or
    /// transform the data to have the proper lifetime.
    /// @param e The bucket to convert
    /// @remark Some bucket types contain data that will always outlive the
    /// bucket itself. For example no data (EOS and FLUSH), or the data
    /// resides in global, constant memory (IMMORTAL), or the data is on
    /// the heap (HEAP). For these buckets, apr_bucket_setaside_noop can
    /// be used.
    pub setaside: ::std::option::Option<unsafe extern "C" fn(e: *mut apr_bucket, pool: *mut apr_pool_t) -> apr_status_t>,
    /// Split one bucket in two at the specified position by duplicating
    /// the bucket structure (not the data) and modifying any necessary
    /// start/end/offset information.  If it's not possible to do this
    /// for the bucket type (perhaps the length of the data is indeterminate,
    /// as with pipe and socket buckets), then APR_ENOTIMPL is returned.
    /// @param e The bucket to split
    /// @param point The offset of the first byte in the new bucket
    pub split: ::std::option::Option<unsafe extern "C" fn(e: *mut apr_bucket, point: apr_size_t) -> apr_status_t>,
    /// Copy the bucket structure (not the data), assuming that this is
    /// possible for the bucket type. If it's not, APR_ENOTIMPL is returned.
    /// @param e The bucket to copy
    /// @param c Returns a pointer to the new bucket
    pub copy: ::std::option::Option<unsafe extern "C" fn(e: *mut apr_bucket, c: *mut *mut apr_bucket) -> apr_status_t>,
}

/// This bucket type represents actual data to send to the client.
pub const apr_bucket_type_t_APR_BUCKET_DATA: apr_bucket_type_t__bindgen_ty_1 = 0;
/// This bucket type represents metadata.
pub const apr_bucket_type_t_APR_BUCKET_METADATA: apr_bucket_type_t__bindgen_ty_1 = 1;

/// Whether the bucket contains metadata (ie, information that
/// describes the regular contents of the brigade).  The metadata
/// is not returned by apr_bucket_read() and is not indicated by
/// the ->length of the apr_bucket itself.  In other words, an
/// empty bucket is safe to arbitrarily remove if and only if it
/// contains no metadata.  In this sense, "data" is just raw bytes
/// that are the "content" of the brigade and "metadata" describes
/// that data but is not a proper part of it.
pub type apr_bucket_type_t__bindgen_ty_1 = u32;

#[test]
fn bindgen_test_layout_apr_bucket_type_t() {
    assert_eq!(::std::mem::size_of::<apr_bucket_type_t>(), 56usize, concat!( "Size of: " , stringify ! ( apr_bucket_type_t ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_type_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket_type_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_type_t>())).name as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_type_t ) , "::" , stringify ! ( name ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_type_t>())).num_func as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_type_t ) , "::" , stringify ! ( num_func ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_type_t>())).is_metadata as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_type_t ) , "::" , stringify ! ( is_metadata ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_type_t>())).destroy as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_type_t ) , "::" , stringify ! ( destroy ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_type_t>())).read as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_type_t ) , "::" , stringify ! ( read ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_type_t>())).setaside as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_type_t ) , "::" , stringify ! ( setaside ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_type_t>())).split as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_type_t ) , "::" , stringify ! ( split ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_type_t>())).copy as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_type_t ) , "::" , stringify ! ( copy ) ));
}

/// apr_bucket structures are allocated on the malloc() heap and
/// their lifetime is controlled by the parent apr_bucket_brigade
/// structure. Buckets can move from one brigade to another e.g. by
/// calling APR_BRIGADE_CONCAT(). In general the data in a bucket has
/// the same lifetime as the bucket and is freed when the bucket is
/// destroyed; if the data is shared by more than one bucket (e.g.
/// after a split) the data is freed when the last bucket goes away.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket {
    /// Links to the rest of the brigade
    pub link: apr_bucket__bindgen_ty_1,
    /// The type of bucket.
    pub type_: *const apr_bucket_type_t,
    /// The length of the data in the bucket.  This could have been implemented
    /// with a function, but this is an optimization, because the most
    /// common thing to do will be to get the length.  If the length is unknown,
    /// the value of this field will be (apr_size_t)(-1).
    pub length: apr_size_t,
    /// The start of the data in the bucket relative to the private base
    /// pointer.  The vast majority of bucket types allow a fixed block of
    /// data to be referenced by multiple buckets, each bucket pointing to
    /// a different segment of the data.  That segment starts at base+start
    /// and ends at base+start+length.
    /// If the length == (apr_size_t)(-1), then start == -1.
    pub start: apr_off_t,
    /// type-dependent data hangs off this pointer
    pub data: *mut ::libc::c_void,
    /// Pointer to function used to free the bucket. This function should
    /// always be defined and it should be consistent with the memory
    /// function used to allocate the bucket. For example, if malloc() is
    /// used to allocate the bucket, this pointer should point to free().
    /// @param e Pointer to the bucket being freed
    pub free: ::std::option::Option<unsafe extern "C" fn(e: *mut ::libc::c_void)>,
    /// The freelist from which this bucket was allocated
    pub list: *mut apr_bucket_alloc_t,
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket__bindgen_ty_1 { pub next: *mut apr_bucket, pub prev: *mut apr_bucket }

#[test]
fn bindgen_test_layout_apr_bucket__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<apr_bucket__bindgen_ty_1>(), 16usize, concat!( "Size of: " , stringify ! ( apr_bucket__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket__bindgen_ty_1>())).next as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket__bindgen_ty_1 ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket__bindgen_ty_1>())).prev as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_bucket__bindgen_ty_1 ) , "::" , stringify ! ( prev ) ));
}

#[test]
fn bindgen_test_layout_apr_bucket() {
    assert_eq!(::std::mem::size_of::<apr_bucket>(), 64usize, concat!( "Size of: " , stringify ! ( apr_bucket ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket>())).link as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket ) , "::" , stringify ! ( link ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket>())).type_ as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_bucket ) , "::" , stringify ! ( type_ ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket>())).length as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_bucket ) , "::" , stringify ! ( length ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket>())).start as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( apr_bucket ) , "::" , stringify ! ( start ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket>())).data as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( apr_bucket ) , "::" , stringify ! ( data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket>())).free as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( apr_bucket ) , "::" , stringify ! ( free ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket>())).list as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( apr_bucket ) , "::" , stringify ! ( list ) ));
}

/// A list of buckets
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_brigade {
    /// The pool to associate the brigade with.  The data is not allocated out
    /// of the pool, but a cleanup is registered with this pool.  If the
    /// brigade is destroyed by some mechanism other than pool destruction,
    /// the destroying function is responsible for killing the cleanup.
    pub p: *mut apr_pool_t,
    pub list: apr_bucket_brigade_apr_bucket_list,
    /// The freelist from which this bucket was allocated
    pub bucket_alloc: *mut apr_bucket_alloc_t,
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_brigade_apr_bucket_list { pub next: *mut apr_bucket, pub prev: *mut apr_bucket }

#[test]
fn bindgen_test_layout_apr_bucket_brigade_apr_bucket_list() {
    assert_eq!(::std::mem::size_of::<apr_bucket_brigade_apr_bucket_list>(), 16usize, concat!( "Size of: " , stringify ! ( apr_bucket_brigade_apr_bucket_list ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_brigade_apr_bucket_list>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket_brigade_apr_bucket_list ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_brigade_apr_bucket_list>())).next as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_brigade_apr_bucket_list ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_brigade_apr_bucket_list>())).prev as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_brigade_apr_bucket_list ) , "::" , stringify ! ( prev ) ));
}

#[test]
fn bindgen_test_layout_apr_bucket_brigade() {
    assert_eq!(::std::mem::size_of::<apr_bucket_brigade>(), 32usize, concat!( "Size of: " , stringify ! ( apr_bucket_brigade ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_brigade>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket_brigade ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_brigade>())).p as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_brigade ) , "::" , stringify ! ( p ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_brigade>())).list as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_brigade ) , "::" , stringify ! ( list ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_brigade>())).bucket_alloc as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_brigade ) , "::" , stringify ! ( bucket_alloc ) ));
}

/// Function called when a brigade should be flushed
pub type apr_brigade_flush = ::std::option::Option<unsafe extern "C" fn(bb: *mut apr_bucket_brigade, ctx: *mut ::libc::c_void) -> apr_status_t>;

/// The structure used to manage the shared resource must start with an
/// apr_bucket_refcount which is updated by the general-purpose refcount
/// code. A pointer to the bucket-type-dependent private data structure
/// can be cast to a pointer to an apr_bucket_refcount and vice versa.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_refcount {
    /// The number of references to this bucket
    pub refcount: ::libc::c_int,
}

#[test]
fn bindgen_test_layout_apr_bucket_refcount() {
    assert_eq!(::std::mem::size_of::<apr_bucket_refcount>(), 4usize, concat!( "Size of: " , stringify ! ( apr_bucket_refcount ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_refcount>(), 4usize, concat!( "Alignment of " , stringify ! ( apr_bucket_refcount ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_refcount>())).refcount as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_refcount ) , "::" , stringify ! ( refcount ) ));
}

/// A bucket referring to data allocated off the heap.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_heap {
    /// Number of buckets using this memory
    pub refcount: apr_bucket_refcount,
    /// The start of the data actually allocated.  This should never be
    /// modified, it is only used to free the bucket.
    pub base: *mut ::libc::c_char,
    /// how much memory was allocated
    pub alloc_len: apr_size_t,
    /// function to use to delete the data
    pub free_func: ::std::option::Option<unsafe extern "C" fn(data: *mut ::libc::c_void)>,
}

#[test]
fn bindgen_test_layout_apr_bucket_heap() {
    assert_eq!(::std::mem::size_of::<apr_bucket_heap>(), 32usize, concat!( "Size of: " , stringify ! ( apr_bucket_heap ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_heap>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket_heap ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_heap>())).refcount as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_heap ) , "::" , stringify ! ( refcount ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_heap>())).base as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_heap ) , "::" , stringify ! ( base ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_heap>())).alloc_len as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_heap ) , "::" , stringify ! ( alloc_len ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_heap>())).free_func as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_heap ) , "::" , stringify ! ( free_func ) ));
}

/// A bucket referring to data allocated from a pool
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_pool {
    /// The pool bucket must be able to be easily morphed to a heap
    /// bucket if the pool gets cleaned up before all references are
    /// destroyed.  This apr_bucket_heap structure is populated automatically
    /// when the pool gets cleaned up, and subsequent calls to pool_read()
    /// will result in the apr_bucket in question being morphed into a
    /// regular heap bucket.  (To avoid having to do many extra refcount
    /// manipulations and b->data manipulations, the apr_bucket_pool
    /// struct actually *contains* the apr_bucket_heap struct that it
    /// will become as its first element; the two share their
    /// apr_bucket_refcount members.)
    pub heap: apr_bucket_heap,
    /// The block of data actually allocated from the pool.
    /// Segments of this block are referenced by adjusting
    /// the start and length of the apr_bucket accordingly.
    /// This will be NULL after the pool gets cleaned up.
    pub base: *const ::libc::c_char,
    /// The pool the data was allocated from.  When the pool
    /// is cleaned up, this gets set to NULL as an indicator
    /// to pool_read() that the data is now on the heap and
    /// so it should morph the bucket into a regular heap
    /// bucket before continuing.
    pub pool: *mut apr_pool_t,
    /// The freelist this structure was allocated from, which is
    /// needed in the cleanup phase in order to allocate space on the heap
    pub list: *mut apr_bucket_alloc_t,
}

#[test]
fn bindgen_test_layout_apr_bucket_pool() {
    assert_eq!(::std::mem::size_of::<apr_bucket_pool>(), 56usize, concat!( "Size of: " , stringify ! ( apr_bucket_pool ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_pool>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket_pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_pool>())).heap as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_pool ) , "::" , stringify ! ( heap ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_pool>())).base as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_pool ) , "::" , stringify ! ( base ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_pool>())).pool as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_pool ) , "::" , stringify ! ( pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_pool>())).list as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_pool ) , "::" , stringify ! ( list ) ));
}

/// A bucket referring to an mmap()ed file
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_mmap {
    /// Number of buckets using this memory
    pub refcount: apr_bucket_refcount,
    /// The mmap this sub_bucket refers to
    pub mmap: *mut apr_mmap_t,
}

#[test]
fn bindgen_test_layout_apr_bucket_mmap() {
    assert_eq!(::std::mem::size_of::<apr_bucket_mmap>(), 16usize, concat!( "Size of: " , stringify ! ( apr_bucket_mmap ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_mmap>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket_mmap ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_mmap>())).refcount as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_mmap ) , "::" , stringify ! ( refcount ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_mmap>())).mmap as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_mmap ) , "::" , stringify ! ( mmap ) ));
}

/// A bucket referring to an file
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_bucket_file {
    /// Number of buckets using this memory
    pub refcount: apr_bucket_refcount,
    /// The file this bucket refers to
    pub fd: *mut apr_file_t,
    /// The pool into which any needed structures should
    /// be created while reading from this file bucket
    pub readpool: *mut apr_pool_t,
    /// Whether this bucket should be memory-mapped if
    /// a caller tries to read from it
    pub can_mmap: ::libc::c_int,
}

#[test]
fn bindgen_test_layout_apr_bucket_file() {
    assert_eq!(::std::mem::size_of::<apr_bucket_file>(), 32usize, concat!( "Size of: " , stringify ! ( apr_bucket_file ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_file>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket_file ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_file>())).refcount as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_file ) , "::" , stringify ! ( refcount ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_file>())).fd as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_file ) , "::" , stringify ! ( fd ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_file>())).readpool as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_file ) , "::" , stringify ! ( readpool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_file>())).can_mmap as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_file ) , "::" , stringify ! ( can_mmap ) ));
}

/// A union of all bucket structures so we know what
/// the max size is.
#[repr(C)]
#[derive(Copy, Clone)]
pub union apr_bucket_structs {
    /// < Bucket
    pub b: apr_bucket,
    /// < Heap
    pub heap: apr_bucket_heap,
    /// < Pool
    pub pool: apr_bucket_pool,
    /// < MMap
    pub mmap: apr_bucket_mmap,
    /// < File
    pub file: apr_bucket_file,
    _bindgen_union_align: [u64; 8usize],
}

#[test]
fn bindgen_test_layout_apr_bucket_structs() {
    assert_eq!(::std::mem::size_of::<apr_bucket_structs>(), 64usize, concat!( "Size of: " , stringify ! ( apr_bucket_structs ) ));
    assert_eq!(::std::mem::align_of::<apr_bucket_structs>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_bucket_structs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_structs>())).b as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_structs ) , "::" , stringify ! ( b ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_structs>())).heap as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_structs ) , "::" , stringify ! ( heap ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_structs>())).pool as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_structs ) , "::" , stringify ! ( pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_structs>())).mmap as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_structs ) , "::" , stringify ! ( mmap ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_bucket_structs>())).file as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_bucket_structs ) , "::" , stringify ! ( file ) ));
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_flush"]
    pub static mut apr_bucket_type_flush: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_eos"]
    pub static mut apr_bucket_type_eos: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_file"]
    pub static mut apr_bucket_type_file: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_heap"]
    pub static mut apr_bucket_type_heap: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_mmap"]
    pub static mut apr_bucket_type_mmap: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_pool"]
    pub static mut apr_bucket_type_pool: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_pipe"]
    pub static mut apr_bucket_type_pipe: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_immortal"]
    pub static mut apr_bucket_type_immortal: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_transient"]
    pub static mut apr_bucket_type_transient: apr_bucket_type_t;
}

extern "C" {
    #[link_name = "\u{1}apr_bucket_type_socket"]
    pub static mut apr_bucket_type_socket: apr_bucket_type_t;
}

/// < Platform default poll method
pub const apr_pollset_method_e_APR_POLLSET_DEFAULT: apr_pollset_method_e = 0;
/// < Poll uses select method
pub const apr_pollset_method_e_APR_POLLSET_SELECT: apr_pollset_method_e = 1;
/// < Poll uses kqueue method
pub const apr_pollset_method_e_APR_POLLSET_KQUEUE: apr_pollset_method_e = 2;
/// < Poll uses Solaris event port method
pub const apr_pollset_method_e_APR_POLLSET_PORT: apr_pollset_method_e = 3;
/// < Poll uses epoll method
pub const apr_pollset_method_e_APR_POLLSET_EPOLL: apr_pollset_method_e = 4;
/// < Poll uses poll method
pub const apr_pollset_method_e_APR_POLLSET_POLL: apr_pollset_method_e = 5;
/// < Poll uses z/OS asio method
pub const apr_pollset_method_e_APR_POLLSET_AIO_MSGQ: apr_pollset_method_e = 6;

/// Pollset Methods
pub type apr_pollset_method_e = u32;

/// < nothing here
pub const apr_datatype_e_APR_NO_DESC: apr_datatype_e = 0;
/// < descriptor refers to a socket
pub const apr_datatype_e_APR_POLL_SOCKET: apr_datatype_e = 1;
/// < descriptor refers to a file
pub const apr_datatype_e_APR_POLL_FILE: apr_datatype_e = 2;
/// < @deprecated descriptor is the last one in the list
pub const apr_datatype_e_APR_POLL_LASTDESC: apr_datatype_e = 3;

/// Used in apr_pollfd_t to determine what the apr_descriptor is
pub type apr_datatype_e = u32;

/// Union of either an APR file or socket.
#[repr(C)]
#[derive(Copy, Clone)]
pub union apr_descriptor {
    /// < file
    pub f: *mut apr_file_t,
    /// < socket
    pub s: *mut apr_socket_t,
    _bindgen_union_align: u64,
}

#[test]
fn bindgen_test_layout_apr_descriptor() {
    assert_eq!(::std::mem::size_of::<apr_descriptor>(), 8usize, concat!( "Size of: " , stringify ! ( apr_descriptor ) ));
    assert_eq!(::std::mem::align_of::<apr_descriptor>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_descriptor ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_descriptor>())).f as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_descriptor ) , "::" , stringify ! ( f ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_descriptor>())).s as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_descriptor ) , "::" , stringify ! ( s ) ));
}

/// Poll descriptor set.
#[repr(C)]
#[derive(Copy, Clone)]
pub struct apr_pollfd_t {
    /// < associated pool
    pub p: *mut apr_pool_t,
    /// < descriptor type
    pub desc_type: apr_datatype_e,
    /// < requested events
    pub reqevents: apr_int16_t,
    /// < returned events
    pub rtnevents: apr_int16_t,
    /// < @see apr_descriptor
    pub desc: apr_descriptor,
    /// < allows app to associate context
    pub client_data: *mut ::libc::c_void,
}

#[test]
fn bindgen_test_layout_apr_pollfd_t() {
    assert_eq!(::std::mem::size_of::<apr_pollfd_t>(), 32usize, concat!( "Size of: " , stringify ! ( apr_pollfd_t ) ));
    assert_eq!(::std::mem::align_of::<apr_pollfd_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_pollfd_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_pollfd_t>())).p as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_pollfd_t ) , "::" , stringify ! ( p ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_pollfd_t>())).desc_type as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_pollfd_t ) , "::" , stringify ! ( desc_type ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_pollfd_t>())).reqevents as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( apr_pollfd_t ) , "::" , stringify ! ( reqevents ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_pollfd_t>())).rtnevents as *const _ as usize }, 14usize, concat!( "Offset of field: " , stringify ! ( apr_pollfd_t ) , "::" , stringify ! ( rtnevents ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_pollfd_t>())).desc as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_pollfd_t ) , "::" , stringify ! ( desc ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_pollfd_t>())).client_data as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_pollfd_t ) , "::" , stringify ! ( client_data ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_pollset_t { _unused: [u8; 0] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_pollcb_t { _unused: [u8; 0] }

/// Function prototype for pollcb handlers
/// @param baton Opaque baton passed into apr_pollcb_poll()
/// @param descriptor Contains the notification for an active descriptor,
/// the rtnevents member contains what events were triggered
/// for this descriptor.
pub type apr_pollcb_cb_t = ::std::option::Option<unsafe extern "C" fn(baton: *mut ::libc::c_void, descriptor: *mut apr_pollfd_t) -> apr_status_t>;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone { pub tz_minuteswest: ::libc::c_int, pub tz_dsttime: ::libc::c_int }

#[test]
fn bindgen_test_layout_timezone() {
    assert_eq!(::std::mem::size_of::<timezone>(), 8usize, concat!( "Size of: " , stringify ! ( timezone ) ));
    assert_eq!(::std::mem::align_of::<timezone>(), 4usize, concat!( "Alignment of " , stringify ! ( timezone ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<timezone>())).tz_minuteswest as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( timezone ) , "::" , stringify ! ( tz_minuteswest ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<timezone>())).tz_dsttime as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( timezone ) , "::" , stringify ! ( tz_dsttime ) ));
}

pub type __timezone_ptr_t = *mut timezone;

pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;

pub type __itimer_which = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval { pub it_interval: timeval, pub it_value: timeval }

#[test]
fn bindgen_test_layout_itimerval() {
    assert_eq!(::std::mem::size_of::<itimerval>(), 32usize, concat!( "Size of: " , stringify ! ( itimerval ) ));
    assert_eq!(::std::mem::align_of::<itimerval>(), 8usize, concat!( "Alignment of " , stringify ! ( itimerval ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<itimerval>())).it_interval as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( itimerval ) , "::" , stringify ! ( it_interval ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<itimerval>())).it_value as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( itimerval ) , "::" , stringify ! ( it_value ) ));
}

pub type __itimer_which_t = ::libc::c_int;

pub const __rlimit_resource_RLIMIT_CPU: __rlimit_resource = 0;
pub const __rlimit_resource_RLIMIT_FSIZE: __rlimit_resource = 1;
pub const __rlimit_resource_RLIMIT_DATA: __rlimit_resource = 2;
pub const __rlimit_resource_RLIMIT_STACK: __rlimit_resource = 3;
pub const __rlimit_resource_RLIMIT_CORE: __rlimit_resource = 4;
pub const __rlimit_resource___RLIMIT_RSS: __rlimit_resource = 5;
pub const __rlimit_resource_RLIMIT_NOFILE: __rlimit_resource = 7;
pub const __rlimit_resource___RLIMIT_OFILE: __rlimit_resource = 7;
pub const __rlimit_resource_RLIMIT_AS: __rlimit_resource = 9;
pub const __rlimit_resource___RLIMIT_NPROC: __rlimit_resource = 6;
pub const __rlimit_resource___RLIMIT_MEMLOCK: __rlimit_resource = 8;
pub const __rlimit_resource___RLIMIT_LOCKS: __rlimit_resource = 10;
pub const __rlimit_resource___RLIMIT_SIGPENDING: __rlimit_resource = 11;
pub const __rlimit_resource___RLIMIT_MSGQUEUE: __rlimit_resource = 12;
pub const __rlimit_resource___RLIMIT_NICE: __rlimit_resource = 13;
pub const __rlimit_resource___RLIMIT_RTPRIO: __rlimit_resource = 14;
pub const __rlimit_resource___RLIMIT_RTTIME: __rlimit_resource = 15;
pub const __rlimit_resource___RLIMIT_NLIMITS: __rlimit_resource = 16;
pub const __rlimit_resource___RLIM_NLIMITS: __rlimit_resource = 16;

pub type __rlimit_resource = u32;
pub type rlim_t = __rlim_t;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rlimit { pub rlim_cur: rlim_t, pub rlim_max: rlim_t }

#[test]
fn bindgen_test_layout_rlimit() {
    assert_eq!(::std::mem::size_of::<rlimit>(), 16usize, concat!( "Size of: " , stringify ! ( rlimit ) ));
    assert_eq!(::std::mem::align_of::<rlimit>(), 8usize, concat!( "Alignment of " , stringify ! ( rlimit ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rlimit>())).rlim_cur as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rlimit ) , "::" , stringify ! ( rlim_cur ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rlimit>())).rlim_max as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( rlimit ) , "::" , stringify ! ( rlim_max ) ));
}

pub const __rusage_who_RUSAGE_SELF: __rusage_who = 0;
pub const __rusage_who_RUSAGE_CHILDREN: __rusage_who = -1;

pub type __rusage_who = i32;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rusage { pub ru_utime: timeval, pub ru_stime: timeval, pub __bindgen_anon_1: rusage__bindgen_ty_1, pub __bindgen_anon_2: rusage__bindgen_ty_2, pub __bindgen_anon_3: rusage__bindgen_ty_3, pub __bindgen_anon_4: rusage__bindgen_ty_4, pub __bindgen_anon_5: rusage__bindgen_ty_5, pub __bindgen_anon_6: rusage__bindgen_ty_6, pub __bindgen_anon_7: rusage__bindgen_ty_7, pub __bindgen_anon_8: rusage__bindgen_ty_8, pub __bindgen_anon_9: rusage__bindgen_ty_9, pub __bindgen_anon_10: rusage__bindgen_ty_10, pub __bindgen_anon_11: rusage__bindgen_ty_11, pub __bindgen_anon_12: rusage__bindgen_ty_12, pub __bindgen_anon_13: rusage__bindgen_ty_13, pub __bindgen_anon_14: rusage__bindgen_ty_14 }

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_1 { pub ru_maxrss: ::libc::c_long, pub __ru_maxrss_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_1>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_1 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_1>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_1>())).ru_maxrss as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_1 ) , "::" , stringify ! ( ru_maxrss ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_1>())).__ru_maxrss_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_1 ) , "::" , stringify ! ( __ru_maxrss_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_2 { pub ru_ixrss: ::libc::c_long, pub __ru_ixrss_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_2>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_2 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_2>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_2 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_2>())).ru_ixrss as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_2 ) , "::" , stringify ! ( ru_ixrss ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_2>())).__ru_ixrss_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_2 ) , "::" , stringify ! ( __ru_ixrss_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_3 { pub ru_idrss: ::libc::c_long, pub __ru_idrss_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_3() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_3>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_3 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_3>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_3 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_3>())).ru_idrss as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_3 ) , "::" , stringify ! ( ru_idrss ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_3>())).__ru_idrss_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_3 ) , "::" , stringify ! ( __ru_idrss_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_4 { pub ru_isrss: ::libc::c_long, pub __ru_isrss_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_4() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_4>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_4 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_4>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_4 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_4>())).ru_isrss as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_4 ) , "::" , stringify ! ( ru_isrss ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_4>())).__ru_isrss_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_4 ) , "::" , stringify ! ( __ru_isrss_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_5 { pub ru_minflt: ::libc::c_long, pub __ru_minflt_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_5() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_5>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_5 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_5>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_5 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_5>())).ru_minflt as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_5 ) , "::" , stringify ! ( ru_minflt ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_5>())).__ru_minflt_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_5 ) , "::" , stringify ! ( __ru_minflt_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_6 { pub ru_majflt: ::libc::c_long, pub __ru_majflt_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_6() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_6>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_6 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_6>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_6 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_6>())).ru_majflt as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_6 ) , "::" , stringify ! ( ru_majflt ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_6>())).__ru_majflt_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_6 ) , "::" , stringify ! ( __ru_majflt_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_7 { pub ru_nswap: ::libc::c_long, pub __ru_nswap_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_7() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_7>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_7 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_7>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_7 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_7>())).ru_nswap as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_7 ) , "::" , stringify ! ( ru_nswap ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_7>())).__ru_nswap_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_7 ) , "::" , stringify ! ( __ru_nswap_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_8 { pub ru_inblock: ::libc::c_long, pub __ru_inblock_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_8() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_8>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_8 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_8>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_8 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_8>())).ru_inblock as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_8 ) , "::" , stringify ! ( ru_inblock ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_8>())).__ru_inblock_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_8 ) , "::" , stringify ! ( __ru_inblock_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_9 { pub ru_oublock: ::libc::c_long, pub __ru_oublock_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_9() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_9>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_9 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_9>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_9 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_9>())).ru_oublock as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_9 ) , "::" , stringify ! ( ru_oublock ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_9>())).__ru_oublock_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_9 ) , "::" , stringify ! ( __ru_oublock_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_10 { pub ru_msgsnd: ::libc::c_long, pub __ru_msgsnd_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_10() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_10>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_10 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_10>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_10 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_10>())).ru_msgsnd as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_10 ) , "::" , stringify ! ( ru_msgsnd ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_10>())).__ru_msgsnd_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_10 ) , "::" , stringify ! ( __ru_msgsnd_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_11 { pub ru_msgrcv: ::libc::c_long, pub __ru_msgrcv_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_11() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_11>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_11 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_11>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_11 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_11>())).ru_msgrcv as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_11 ) , "::" , stringify ! ( ru_msgrcv ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_11>())).__ru_msgrcv_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_11 ) , "::" , stringify ! ( __ru_msgrcv_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_12 { pub ru_nsignals: ::libc::c_long, pub __ru_nsignals_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_12() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_12>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_12 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_12>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_12 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_12>())).ru_nsignals as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_12 ) , "::" , stringify ! ( ru_nsignals ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_12>())).__ru_nsignals_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_12 ) , "::" , stringify ! ( __ru_nsignals_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_13 { pub ru_nvcsw: ::libc::c_long, pub __ru_nvcsw_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_13() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_13>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_13 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_13>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_13 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_13>())).ru_nvcsw as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_13 ) , "::" , stringify ! ( ru_nvcsw ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_13>())).__ru_nvcsw_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_13 ) , "::" , stringify ! ( __ru_nvcsw_word ) ));
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rusage__bindgen_ty_14 { pub ru_nivcsw: ::libc::c_long, pub __ru_nivcsw_word: __syscall_slong_t, _bindgen_union_align: u64 }

#[test]
fn bindgen_test_layout_rusage__bindgen_ty_14() {
    assert_eq!(::std::mem::size_of::<rusage__bindgen_ty_14>(), 8usize, concat!( "Size of: " , stringify ! ( rusage__bindgen_ty_14 ) ));
    assert_eq!(::std::mem::align_of::<rusage__bindgen_ty_14>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage__bindgen_ty_14 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_14>())).ru_nivcsw as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_14 ) , "::" , stringify ! ( ru_nivcsw ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage__bindgen_ty_14>())).__ru_nivcsw_word as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage__bindgen_ty_14 ) , "::" , stringify ! ( __ru_nivcsw_word ) ));
}

#[test]
fn bindgen_test_layout_rusage() {
    assert_eq!(::std::mem::size_of::<rusage>(), 144usize, concat!( "Size of: " , stringify ! ( rusage ) ));
    assert_eq!(::std::mem::align_of::<rusage>(), 8usize, concat!( "Alignment of " , stringify ! ( rusage ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage>())).ru_utime as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( rusage ) , "::" , stringify ! ( ru_utime ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<rusage>())).ru_stime as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( rusage ) , "::" , stringify ! ( ru_stime ) ));
}

pub const __priority_which_PRIO_PROCESS: __priority_which = 0;
pub const __priority_which_PRIO_PGRP: __priority_which = 1;
pub const __priority_which_PRIO_USER: __priority_which = 2;

pub type __priority_which = u32;
pub type __rlimit_resource_t = ::libc::c_int;
pub type __rusage_who_t = ::libc::c_int;
pub type __priority_which_t = ::libc::c_int;

/// < use the shell to invoke the program
pub const apr_cmdtype_e_APR_SHELLCMD: apr_cmdtype_e = 0;
/// < invoke the program directly, no copied env
pub const apr_cmdtype_e_APR_PROGRAM: apr_cmdtype_e = 1;
/// < invoke the program, replicating our environment
pub const apr_cmdtype_e_APR_PROGRAM_ENV: apr_cmdtype_e = 2;
/// < find program on PATH, use our environment
pub const apr_cmdtype_e_APR_PROGRAM_PATH: apr_cmdtype_e = 3;
/// < use the shell to invoke the program,
/// replicating our environment
pub const apr_cmdtype_e_APR_SHELLCMD_ENV: apr_cmdtype_e = 4;

/// @defgroup apr_thread_proc Threads and Process Functions
/// @ingroup APR
/// @{
pub type apr_cmdtype_e = u32;

/// < wait for the specified process to finish
pub const apr_wait_how_e_APR_WAIT: apr_wait_how_e = 0;
/// < do not wait -- just see if it has finished
pub const apr_wait_how_e_APR_NOWAIT: apr_wait_how_e = 1;

pub type apr_wait_how_e = u32;

/// < process exited normally
pub const apr_exit_why_e_APR_PROC_EXIT: apr_exit_why_e = 1;
/// < process exited due to a signal
pub const apr_exit_why_e_APR_PROC_SIGNAL: apr_exit_why_e = 2;
/// < process exited and dumped a core file
pub const apr_exit_why_e_APR_PROC_SIGNAL_CORE: apr_exit_why_e = 4;

pub type apr_exit_why_e = u32;

/// The APR process type
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_proc_t {
    /// The process ID
    pub pid: pid_t,
    /// Parent's side of pipe to child's stdin
    pub in_: *mut apr_file_t,
    /// Parent's side of pipe to child's stdout
    pub out: *mut apr_file_t,
    /// Parent's side of pipe to child's stdouterr
    pub err: *mut apr_file_t,
}

#[test]
fn bindgen_test_layout_apr_proc_t() {
    assert_eq!(::std::mem::size_of::<apr_proc_t>(), 32usize, concat!( "Size of: " , stringify ! ( apr_proc_t ) ));
    assert_eq!(::std::mem::align_of::<apr_proc_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_proc_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_proc_t>())).pid as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_proc_t ) , "::" , stringify ! ( pid ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_proc_t>())).in_ as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_proc_t ) , "::" , stringify ! ( in_ ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_proc_t>())).out as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_proc_t ) , "::" , stringify ! ( out ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_proc_t>())).err as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_proc_t ) , "::" , stringify ! ( err ) ));
}

/// The prototype for APR child errfn functions.  (See the description
/// of apr_procattr_child_errfn_set() for more information.)
/// It is passed the following parameters:
/// @param pool Pool associated with the apr_proc_t.  If your child
/// error function needs user data, associate it with this
/// pool.
/// @param err APR error code describing the error
/// @param description Text description of type of processing which failed
pub type apr_child_errfn_t = ::std::option::Option<unsafe extern "C" fn(proc_: *mut apr_pool_t, err: apr_status_t, description: *const ::libc::c_char)>;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_thread_t { _unused: [u8; 0] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_threadattr_t { _unused: [u8; 0] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_procattr_t { _unused: [u8; 0] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_thread_once_t { _unused: [u8; 0] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_threadkey_t { _unused: [u8; 0] }

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_other_child_rec_t { _unused: [u8; 0] }

/// The prototype for any APR thread worker functions.
pub type apr_thread_start_t = ::std::option::Option<unsafe extern "C" fn(arg1: *mut apr_thread_t, arg2: *mut ::libc::c_void) -> *mut ::libc::c_void>;

/// < process is never killed (i.e., never sent
/// any signals), but it will be reaped if it exits
/// before the pool is cleaned up
pub const apr_kill_conditions_e_APR_KILL_NEVER: apr_kill_conditions_e = 0;
/// < process is sent SIGKILL on apr_pool_t cleanup
pub const apr_kill_conditions_e_APR_KILL_ALWAYS: apr_kill_conditions_e = 1;
/// < SIGTERM, wait 3 seconds, SIGKILL
pub const apr_kill_conditions_e_APR_KILL_AFTER_TIMEOUT: apr_kill_conditions_e = 2;
/// < wait forever for the process to complete
pub const apr_kill_conditions_e_APR_JUST_WAIT: apr_kill_conditions_e = 3;
/// < send SIGTERM and then wait
pub const apr_kill_conditions_e_APR_KILL_ONLY_ONCE: apr_kill_conditions_e = 4;

pub type apr_kill_conditions_e = u32;

pub const AP_REG_ASSERT: _bindgen_ty_16 = 1;
/// internal error ?
pub const AP_REG_ESPACE: _bindgen_ty_16 = 2;
/// failed to get memory
pub const AP_REG_INVARG: _bindgen_ty_16 = 3;
/// invalid argument
pub const AP_REG_NOMATCH: _bindgen_ty_16 = 4;

pub type _bindgen_ty_16 = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_regex_t { pub re_pcre: *mut ::libc::c_void, pub re_nsub: ::libc::c_int, pub re_erroffset: apr_size_t }

#[test]
fn bindgen_test_layout_ap_regex_t() {
    assert_eq!(::std::mem::size_of::<ap_regex_t>(), 24usize, concat!( "Size of: " , stringify ! ( ap_regex_t ) ));
    assert_eq!(::std::mem::align_of::<ap_regex_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_regex_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_regex_t>())).re_pcre as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_regex_t ) , "::" , stringify ! ( re_pcre ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_regex_t>())).re_nsub as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_regex_t ) , "::" , stringify ! ( re_nsub ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_regex_t>())).re_erroffset as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( ap_regex_t ) , "::" , stringify ! ( re_erroffset ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_regmatch_t { pub rm_so: ::libc::c_int, pub rm_eo: ::libc::c_int }

#[test]
fn bindgen_test_layout_ap_regmatch_t() {
    assert_eq!(::std::mem::size_of::<ap_regmatch_t>(), 8usize, concat!( "Size of: " , stringify ! ( ap_regmatch_t ) ));
    assert_eq!(::std::mem::align_of::<ap_regmatch_t>(), 4usize, concat!( "Alignment of " , stringify ! ( ap_regmatch_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_regmatch_t>())).rm_so as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_regmatch_t ) , "::" , stringify ! ( rm_so ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_regmatch_t>())).rm_eo as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ap_regmatch_t ) , "::" , stringify ! ( rm_eo ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_rxplus_t { pub rx: ap_regex_t, pub flags: apr_uint32_t, pub subs: *const ::libc::c_char, pub match_: *const ::libc::c_char, pub nmatch: apr_size_t, pub pmatch: *mut ap_regmatch_t }

#[test]
fn bindgen_test_layout_ap_rxplus_t() {
    assert_eq!(::std::mem::size_of::<ap_rxplus_t>(), 64usize, concat!( "Size of: " , stringify ! ( ap_rxplus_t ) ));
    assert_eq!(::std::mem::align_of::<ap_rxplus_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_rxplus_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_rxplus_t>())).rx as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_rxplus_t ) , "::" , stringify ! ( rx ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_rxplus_t>())).flags as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( ap_rxplus_t ) , "::" , stringify ! ( flags ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_rxplus_t>())).subs as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( ap_rxplus_t ) , "::" , stringify ! ( subs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_rxplus_t>())).match_ as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( ap_rxplus_t ) , "::" , stringify ! ( match_ ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_rxplus_t>())).nmatch as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( ap_rxplus_t ) , "::" , stringify ! ( nmatch ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_rxplus_t>())).pmatch as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( ap_rxplus_t ) , "::" , stringify ! ( pmatch ) ));
}

pub type wchar_t = ::libc::c_int;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t { pub quot: ::libc::c_int, pub rem: ::libc::c_int }

#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(::std::mem::size_of::<div_t>(), 8usize, concat!( "Size of: " , stringify ! ( div_t ) ));
    assert_eq!(::std::mem::align_of::<div_t>(), 4usize, concat!( "Alignment of " , stringify ! ( div_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( div_t ) , "::" , stringify ! ( quot ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( div_t ) , "::" , stringify ! ( rem ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t { pub quot: ::libc::c_long, pub rem: ::libc::c_long }

#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(::std::mem::size_of::<ldiv_t>(), 16usize, concat!( "Size of: " , stringify ! ( ldiv_t ) ));
    assert_eq!(::std::mem::align_of::<ldiv_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ldiv_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ldiv_t ) , "::" , stringify ! ( quot ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ldiv_t ) , "::" , stringify ! ( rem ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t { pub quot: ::libc::c_longlong, pub rem: ::libc::c_longlong }

#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(::std::mem::size_of::<lldiv_t>(), 16usize, concat!( "Size of: " , stringify ! ( lldiv_t ) ));
    assert_eq!(::std::mem::align_of::<lldiv_t>(), 8usize, concat!( "Alignment of " , stringify ! ( lldiv_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( lldiv_t ) , "::" , stringify ! ( quot ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( lldiv_t ) , "::" , stringify ! ( rem ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data { pub fptr: *mut i32, pub rptr: *mut i32, pub state: *mut i32, pub rand_type: ::libc::c_int, pub rand_deg: ::libc::c_int, pub rand_sep: ::libc::c_int, pub end_ptr: *mut i32 }

#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(::std::mem::size_of::<random_data>(), 48usize, concat!( "Size of: " , stringify ! ( random_data ) ));
    assert_eq!(::std::mem::align_of::<random_data>(), 8usize, concat!( "Alignment of " , stringify ! ( random_data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( random_data ) , "::" , stringify ! ( fptr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( random_data ) , "::" , stringify ! ( rptr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( random_data ) , "::" , stringify ! ( state ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( random_data ) , "::" , stringify ! ( rand_type ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize }, 28usize, concat!( "Offset of field: " , stringify ! ( random_data ) , "::" , stringify ! ( rand_deg ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( random_data ) , "::" , stringify ! ( rand_sep ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( random_data ) , "::" , stringify ! ( end_ptr ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data { pub __x: [::libc::c_ushort; 3usize], pub __old_x: [::libc::c_ushort; 3usize], pub __c: ::libc::c_ushort, pub __init: ::libc::c_ushort, pub __a: ::libc::c_ulonglong }

#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(::std::mem::size_of::<drand48_data>(), 24usize, concat!( "Size of: " , stringify ! ( drand48_data ) ));
    assert_eq!(::std::mem::align_of::<drand48_data>(), 8usize, concat!( "Alignment of " , stringify ! ( drand48_data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __x ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize }, 6usize, concat!( "Offset of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __old_x ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __c ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize }, 14usize, concat!( "Offset of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __init ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __a ) ));
}

pub type __compar_fn_t = ::std::option::Option<unsafe extern "C" fn(arg1: *const ::libc::c_void, arg2: *const ::libc::c_void) -> ::libc::c_int>;

/// @brief The numeric version information is broken out into fields within this
/// structure.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_version_t {
    /// < major number
    pub major: ::libc::c_int,
    /// < minor number
    pub minor: ::libc::c_int,
    /// < patch number
    pub patch: ::libc::c_int,
    /// < additional string like "-dev"
    pub add_string: *const ::libc::c_char,
}

#[test]
fn bindgen_test_layout_ap_version_t() {
    assert_eq!(::std::mem::size_of::<ap_version_t>(), 24usize, concat!( "Size of: " , stringify ! ( ap_version_t ) ));
    assert_eq!(::std::mem::align_of::<ap_version_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_version_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_version_t>())).major as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_version_t ) , "::" , stringify ! ( major ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_version_t>())).minor as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ap_version_t ) , "::" , stringify ! ( minor ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_version_t>())).patch as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_version_t ) , "::" , stringify ! ( patch ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_version_t>())).add_string as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( ap_version_t ) , "::" , stringify ! ( add_string ) ));
}

/// @struct ap_method_list_t
/// @brief  Structure for handling HTTP methods.
///
/// Methods known to the server are accessed via a bitmask shortcut;
/// extension methods are handled by an array.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_method_list_t {
    /// The bitmask used for known methods
    pub method_mask: apr_int64_t,
    /// the array used for extension methods
    pub method_list: *mut apr_array_header_t,
}

#[test]
fn bindgen_test_layout_ap_method_list_t() {
    assert_eq!(::std::mem::size_of::<ap_method_list_t>(), 16usize, concat!( "Size of: " , stringify ! ( ap_method_list_t ) ));
    assert_eq!(::std::mem::align_of::<ap_method_list_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_method_list_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_method_list_t>())).method_mask as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_method_list_t ) , "::" , stringify ! ( method_mask ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_method_list_t>())).method_list as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_method_list_t ) , "::" , stringify ! ( method_list ) ));
}

/// @brief This represents the result of calling htaccess; these are cached for
/// each request.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct htaccess_result {
    /// the directory to which this applies
    pub dir: *const ::libc::c_char,
    /// the overrides allowed for the .htaccess file
    pub override_: ::libc::c_int,
    /// the override options allowed for the .htaccess file
    pub override_opts: ::libc::c_int,
    /// Table of allowed directives for override
    pub override_list: *mut apr_table_t,
    /// the configuration directives
    pub htaccess: *mut ap_conf_vector_t,
    /// the next one, or NULL if no more; N.B. never change this
    pub next: *const htaccess_result,
}

#[test]
fn bindgen_test_layout_htaccess_result() {
    assert_eq!(::std::mem::size_of::<htaccess_result>(), 40usize, concat!( "Size of: " , stringify ! ( htaccess_result ) ));
    assert_eq!(::std::mem::align_of::<htaccess_result>(), 8usize, concat!( "Alignment of " , stringify ! ( htaccess_result ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<htaccess_result>())).dir as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( htaccess_result ) , "::" , stringify ! ( dir ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<htaccess_result>())).override_ as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( htaccess_result ) , "::" , stringify ! ( override_ ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<htaccess_result>())).override_opts as *const _ as usize }, 12usize, concat!( "Offset of field: " , stringify ! ( htaccess_result ) , "::" , stringify ! ( override_opts ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<htaccess_result>())).override_list as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( htaccess_result ) , "::" , stringify ! ( override_list ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<htaccess_result>())).htaccess as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( htaccess_result ) , "::" , stringify ! ( htaccess ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<htaccess_result>())).next as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( htaccess_result ) , "::" , stringify ! ( next ) ));
}

/// A structure to encompass all of the fields in a uri
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apr_uri_t {
    /// scheme ("http"/"ftp"/...)
    pub scheme: *mut ::libc::c_char,
    /// combined [user[:password]\@]host[:port]
    pub hostinfo: *mut ::libc::c_char,
    /// user name, as in http://user:passwd\@host:port/
    pub user: *mut ::libc::c_char,
    /// password, as in http://user:passwd\@host:port/
    pub password: *mut ::libc::c_char,
    /// hostname from URI (or from Host: header)
    pub hostname: *mut ::libc::c_char,
    /// port string (integer representation is in "port")
    pub port_str: *mut ::libc::c_char,
    /// the request path (or NULL if only scheme://host was given)
    pub path: *mut ::libc::c_char,
    /// Everything after a '?' in the path, if present
    pub query: *mut ::libc::c_char,
    /// Trailing "#fragment" string, if present
    pub fragment: *mut ::libc::c_char,
    /// structure returned from gethostbyname()
    pub hostent: *mut hostent,
    /// The port number, numeric, valid only if port_str != NULL
    pub port: apr_port_t,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: [u8; 5usize],
}

#[test]
fn bindgen_test_layout_apr_uri_t() {
    assert_eq!(::std::mem::size_of::<apr_uri_t>(), 88usize, concat!( "Size of: " , stringify ! ( apr_uri_t ) ));
    assert_eq!(::std::mem::align_of::<apr_uri_t>(), 8usize, concat!( "Alignment of " , stringify ! ( apr_uri_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).scheme as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( scheme ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).hostinfo as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( hostinfo ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).user as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( user ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).password as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( password ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).hostname as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( hostname ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).port_str as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( port_str ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).path as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( path ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).query as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( query ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).fragment as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( fragment ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).hostent as *const _ as usize }, 72usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( hostent ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<apr_uri_t>())).port as *const _ as usize }, 80usize, concat!( "Offset of field: " , stringify ! ( apr_uri_t ) , "::" , stringify ! ( port ) ));
}

impl apr_uri_t {
    #[inline]
    pub fn is_initialized(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) } }
    #[inline]
    pub fn set_is_initialized(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dns_looked_up(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) } }
    #[inline]
    pub fn set_dns_looked_up(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dns_resolved(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) } }
    #[inline]
    pub fn set_dns_resolved(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(is_initialized: ::libc::c_uint, dns_looked_up: ::libc::c_uint, dns_resolved: ::libc::c_uint) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let is_initialized: u32 = unsafe { ::std::mem::transmute(is_initialized) };
            is_initialized as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let dns_looked_up: u32 = unsafe { ::std::mem::transmute(dns_looked_up) };
            dns_looked_up as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let dns_resolved: u32 = unsafe { ::std::mem::transmute(dns_resolved) };
            dns_resolved as u64
        });
        __bindgen_bitfield_unit
    }
}

/// @brief A structure that represents one process
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct process_rec {
    /// Global pool. Cleared upon normal exit
    pub pool: *mut apr_pool_t,
    /// Configuration pool. Cleared upon restart
    pub pconf: *mut apr_pool_t,
    /// The program name used to execute the program
    pub short_name: *const ::libc::c_char,
    /// The command line arguments
    pub argv: *const *const ::libc::c_char,
    /// Number of command line arguments passed to the program
    pub argc: ::libc::c_int,
}

#[test]
fn bindgen_test_layout_process_rec() {
    assert_eq!(::std::mem::size_of::<process_rec>(), 40usize, concat!( "Size of: " , stringify ! ( process_rec ) ));
    assert_eq!(::std::mem::align_of::<process_rec>(), 8usize, concat!( "Alignment of " , stringify ! ( process_rec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<process_rec>())).pool as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( process_rec ) , "::" , stringify ! ( pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<process_rec>())).pconf as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( process_rec ) , "::" , stringify ! ( pconf ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<process_rec>())).short_name as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( process_rec ) , "::" , stringify ! ( short_name ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<process_rec>())).argv as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( process_rec ) , "::" , stringify ! ( argv ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<process_rec>())).argc as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( process_rec ) , "::" , stringify ! ( argc ) ));
}

/// @brief A structure that represents the current request
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct request_rec {
    /// The pool associated with the request
    pub pool: *mut ffi::apr_pool_t,
    /// The connection to the client
    pub connection: *mut ffi::conn_rec,
    /// The virtual host for this request
    pub server: *mut ffi::server_rec,
    /// Pointer to the redirected request if this is an external redirect
    pub next: *mut ffi::request_rec,
    /// Pointer to the previous request if this is an internal redirect
    pub prev: *mut ffi::request_rec,
    /// Pointer to the main request if this is a sub-request
    /// (see http_request.h)
    pub main: *mut request_rec,
    /// First line of request
    pub the_request: *mut ::libc::c_char,
    /// HTTP/0.9, "simple" request (e.g. GET /foo\n w/no headers)
    pub assbackwards: ::libc::c_int,
    /// A proxy request (calculated during post_read_request/translate_name)
    /// possible values PROXYREQ_NONE, PROXYREQ_PROXY, PROXYREQ_REVERSE,
    /// PROXYREQ_RESPONSE
    pub proxyreq: ::libc::c_int,
    /// HEAD request, as opposed to GET
    pub header_only: ::libc::c_int,
    /// Protocol version number of protocol; 1.1 = 1001
    pub proto_num: ::libc::c_int,
    /// Protocol string, as given to us, or HTTP/0.9
    pub protocol: *mut ::libc::c_char,
    /// Host, as set by full URI or Host:
    pub hostname: *const ::libc::c_char,
    /// Time when the request started
    pub request_time: apr_time_t,
    /// Status line, if set by script
    pub status_line: *const ::libc::c_char,
    /// Status line
    pub status: ::libc::c_int,
    /// M_GET, M_POST, etc.
    pub method_number: ::libc::c_int,
    /// Request method (eg. GET, HEAD, POST, etc.)
    pub method: *const ::libc::c_char,
    /// 'allowed' is a bitvector of the allowed methods.
    ///
    /// A handler must ensure that the request method is one that
    /// it is capable of handling.  Generally modules should DECLINE
    /// any request methods they do not handle.  Prior to aborting the
    /// handler like this the handler should set r->allowed to the list
    /// of methods that it is willing to handle.  This bitvector is used
    /// to construct the "Allow:" header required for OPTIONS requests,
    /// and HTTP_METHOD_NOT_ALLOWED and HTTP_NOT_IMPLEMENTED status codes.
    ///
    /// Since the default_handler deals with OPTIONS, all modules can
    /// usually decline to deal with OPTIONS.  TRACE is always allowed,
    /// modules don't need to set it explicitly.
    ///
    /// Since the default_handler will always handle a GET, a
    /// module which does *not* implement GET should probably return
    /// HTTP_METHOD_NOT_ALLOWED.  Unfortunately this means that a Script GET
    /// handler can't be installed by mod_actions.
    pub allowed: apr_int64_t,
    /// Array of extension methods
    pub allowed_xmethods: *mut ffi::apr_array_header_t,
    /// List of allowed methods
    pub allowed_methods: *mut ap_method_list_t,
    /// byte count in stream is for body
    pub sent_bodyct: apr_off_t,
    /// body byte count, for easy access
    pub bytes_sent: apr_off_t,
    /// Last modified time of the requested resource
    pub mtime: apr_time_t,
    /// The Range: header
    pub range: *const ::libc::c_char,
    /// The "real" content length
    pub clength: apr_off_t,
    /// sending chunked transfer-coding
    pub chunked: ::libc::c_int,
    /// Method for reading the request body
    /// (eg. REQUEST_CHUNKED_ERROR, REQUEST_NO_BODY,
    /// REQUEST_CHUNKED_DECHUNK, etc...)
    pub read_body: ::libc::c_int,
    /// reading chunked transfer-coding
    pub read_chunked: ::libc::c_int,
    /// is client waiting for a 100 response?
    pub expecting_100: ::libc::c_uint,
    /// The optional kept body of the request.
    pub kept_body: *mut ffi::apr_bucket_brigade,
    /// For ap_body_to_table(): parsed body
    pub body_table: *mut ffi::apr_table_t,
    /// Remaining bytes left to read from the request body
    pub remaining: apr_off_t,
    /// Number of bytes that have been read  from the request body
    pub read_length: apr_off_t,
    /// MIME header environment from the request
    pub headers_in: *mut ffi::apr_table_t,
    /// MIME header environment for the response
    pub headers_out: *mut ffi::apr_table_t,
    /// MIME header environment for the response, printed even on errors and
    /// persist across internal redirects
    pub err_headers_out: *mut ffi::apr_table_t,
    /// Array of environment variables to be used for sub processes
    pub subprocess_env: *mut ffi::apr_table_t,
    /// Notes from one module to another
    pub notes: *mut ffi::apr_table_t,
    /// The content-type for the current request
    pub content_type: *const ::libc::c_char,
    /// The handler string that we use to call a handler function
    pub handler: *const ::libc::c_char,
    /// How to encode the data
    pub content_encoding: *const ::libc::c_char,
    /// Array of strings representing the content languages
    pub content_languages: *mut ffi::apr_array_header_t,
    /// variant list validator (if negotiated)
    pub vlist_validator: *mut ::libc::c_char,
    /// If an authentication check was made, this gets set to the user name.
    pub user: *mut ::libc::c_char,
    /// If an authentication check was made, this gets set to the auth type.
    pub ap_auth_type: *mut ::libc::c_char,
    /// The URI without any parsing performed
    pub unparsed_uri: *mut ::libc::c_char,
    /// The path portion of the URI, or "/" if no path provided
    pub uri: *mut ::libc::c_char,
    /// The filename on disk corresponding to this response
    pub filename: *mut ::libc::c_char,
    /// The true filename, we canonicalize r->filename if these don't match
    pub canonical_filename: *mut ::libc::c_char,
    /// The PATH_INFO extracted from this request
    pub path_info: *mut ::libc::c_char,
    /// The QUERY_ARGS extracted from this request
    pub args: *mut ::libc::c_char,
    /// Flag for the handler to accept or reject path_info on
    /// the current request.  All modules should respect the
    /// AP_REQ_ACCEPT_PATH_INFO and AP_REQ_REJECT_PATH_INFO
    /// values, while AP_REQ_DEFAULT_PATH_INFO indicates they
    /// may follow existing conventions.  This is set to the
    /// user's preference upon HOOK_VERY_FIRST of the fixups.
    pub used_path_info: ::libc::c_int,
    /// A flag to determine if the eos bucket has been sent yet
    pub eos_sent: ::libc::c_int,
    /// Options set in config files, etc.
    pub per_dir_config: *mut ffi::ap_conf_vector_t,
    /// Notes on *this* request
    pub request_config: *mut ffi::ap_conf_vector_t,
    /// Optional request log level configuration. Will usually point
    /// to a server or per_dir config, i.e. must be copied before
    /// modifying
    pub log: *const ap_logconf,
    /// Id to identify request in access and error log. Set when the first
    /// error log entry for this request is generated.
    pub log_id: *const ::libc::c_char,
    /// A linked list of the .htaccess configuration directives
    /// accessed by this request.
    /// N.B. always add to the head of the list, _never_ to the end.
    /// that way, a sub request's list can (temporarily) point to a parent's list
    pub htaccess: *const htaccess_result,
    /// A list of output filters to be used for this request
    pub output_filters: *mut ap_filter_t,
    /// A list of input filters to be used for this request
    pub input_filters: *mut ffi::ap_filter_t,
    /// A list of protocol level output filters to be used for this
    /// request
    pub proto_output_filters: *mut ffi::ap_filter_t,
    /// A list of protocol level input filters to be used for this
    /// request
    pub proto_input_filters: *mut ffi::ap_filter_t,
    /// This response can not be cached
    pub no_cache: ::libc::c_int,
    /// There is no local copy of this response
    pub no_local_copy: ::libc::c_int,
    /// Mutex protect callbacks registered with ap_mpm_register_timed_callback
    /// from being run before the original handler finishes running
    pub invoke_mtx: *mut apr_thread_mutex_t,
    /// A struct containing the components of URI
    pub parsed_uri: apr_uri_t,
    /// finfo.protection (st_mode) set to zero if no such file
    pub finfo: apr_finfo_t,
    /// remote address information from conn_rec, can be overridden if
    /// necessary by a module.
    /// This is the address that originated the request.
    pub useragent_addr: *mut ffi::apr_sockaddr_t,
    pub useragent_ip: *mut ::libc::c_char,
}

#[test]
fn bindgen_test_layout_request_rec() {
    assert_eq!(::std::mem::size_of::<request_rec>(), 696usize, concat!( "Size of: " , stringify ! ( request_rec ) ));
    assert_eq!(::std::mem::align_of::<request_rec>(), 8usize, concat!( "Alignment of " , stringify ! ( request_rec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).pool as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).connection as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( connection ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).server as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( server ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).next as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).prev as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( prev ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).main as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( main ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).the_request as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( the_request ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).assbackwards as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( assbackwards ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).proxyreq as *const _ as usize }, 60usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( proxyreq ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).header_only as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( header_only ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).proto_num as *const _ as usize }, 68usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( proto_num ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).protocol as *const _ as usize }, 72usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( protocol ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).hostname as *const _ as usize }, 80usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( hostname ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).request_time as *const _ as usize }, 88usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( request_time ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).status_line as *const _ as usize }, 96usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( status_line ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).status as *const _ as usize }, 104usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( status ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).method_number as *const _ as usize }, 108usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( method_number ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).method as *const _ as usize }, 112usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( method ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).allowed as *const _ as usize }, 120usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( allowed ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).allowed_xmethods as *const _ as usize }, 128usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( allowed_xmethods ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).allowed_methods as *const _ as usize }, 136usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( allowed_methods ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).sent_bodyct as *const _ as usize }, 144usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( sent_bodyct ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).bytes_sent as *const _ as usize }, 152usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( bytes_sent ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).mtime as *const _ as usize }, 160usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( mtime ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).range as *const _ as usize }, 168usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( range ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).clength as *const _ as usize }, 176usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( clength ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).chunked as *const _ as usize }, 184usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( chunked ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).read_body as *const _ as usize }, 188usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( read_body ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).read_chunked as *const _ as usize }, 192usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( read_chunked ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).expecting_100 as *const _ as usize }, 196usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( expecting_100 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).kept_body as *const _ as usize }, 200usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( kept_body ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).body_table as *const _ as usize }, 208usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( body_table ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).remaining as *const _ as usize }, 216usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( remaining ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).read_length as *const _ as usize }, 224usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( read_length ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).headers_in as *const _ as usize }, 232usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( headers_in ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).headers_out as *const _ as usize }, 240usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( headers_out ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).err_headers_out as *const _ as usize }, 248usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( err_headers_out ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).subprocess_env as *const _ as usize }, 256usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( subprocess_env ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).notes as *const _ as usize }, 264usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( notes ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).content_type as *const _ as usize }, 272usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( content_type ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).handler as *const _ as usize }, 280usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( handler ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).content_encoding as *const _ as usize }, 288usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( content_encoding ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).content_languages as *const _ as usize }, 296usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( content_languages ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).vlist_validator as *const _ as usize }, 304usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( vlist_validator ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).user as *const _ as usize }, 312usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( user ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).ap_auth_type as *const _ as usize }, 320usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( ap_auth_type ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).unparsed_uri as *const _ as usize }, 328usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( unparsed_uri ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).uri as *const _ as usize }, 336usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( uri ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).filename as *const _ as usize }, 344usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( filename ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).canonical_filename as *const _ as usize }, 352usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( canonical_filename ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).path_info as *const _ as usize }, 360usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( path_info ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).args as *const _ as usize }, 368usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( args ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).used_path_info as *const _ as usize }, 376usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( used_path_info ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).eos_sent as *const _ as usize }, 380usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( eos_sent ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).per_dir_config as *const _ as usize }, 384usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( per_dir_config ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).request_config as *const _ as usize }, 392usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( request_config ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).log as *const _ as usize }, 400usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( log ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).log_id as *const _ as usize }, 408usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( log_id ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).htaccess as *const _ as usize }, 416usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( htaccess ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).output_filters as *const _ as usize }, 424usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( output_filters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).input_filters as *const _ as usize }, 432usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( input_filters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).proto_output_filters as *const _ as usize }, 440usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( proto_output_filters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).proto_input_filters as *const _ as usize }, 448usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( proto_input_filters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).no_cache as *const _ as usize }, 456usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( no_cache ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).no_local_copy as *const _ as usize }, 460usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( no_local_copy ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).invoke_mtx as *const _ as usize }, 464usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( invoke_mtx ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).parsed_uri as *const _ as usize }, 472usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( parsed_uri ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).finfo as *const _ as usize }, 560usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( finfo ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).useragent_addr as *const _ as usize }, 680usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( useragent_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<request_rec>())).useragent_ip as *const _ as usize }, 688usize, concat!( "Offset of field: " , stringify ! ( request_rec ) , "::" , stringify ! ( useragent_ip ) ));
}

pub const ap_conn_keepalive_e_AP_CONN_UNKNOWN: ap_conn_keepalive_e = 0;
pub const ap_conn_keepalive_e_AP_CONN_CLOSE: ap_conn_keepalive_e = 1;
pub const ap_conn_keepalive_e_AP_CONN_KEEPALIVE: ap_conn_keepalive_e = 2;

/// @brief Enumeration of connection keepalive options
pub type ap_conn_keepalive_e = u32;

/// @brief Structure to store things which are per connection
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct conn_rec {
    /// Pool associated with this connection
    pub pool: *mut ffi::apr_pool_t,
    /// Physical vhost this conn came in on
    pub base_server: *mut ffi::server_rec,
    /// used by http_vhost.c
    pub vhost_lookup_data: *mut ::libc::c_void,
    /// local address
    pub local_addr: *mut ffi::apr_sockaddr_t,
    /// remote address; this is the end-point of the next hop, for the address
    /// of the request creator, see useragent_addr in request_rec
    pub client_addr: *mut apr_sockaddr_t,
    /// Client's IP address; this is the end-point of the next hop, for the
    /// IP of the request creator, see useragent_ip in request_rec
    pub client_ip: *mut ::libc::c_char,
    /// Client's DNS name, if known.  NULL if DNS hasn't been checked,
    /// "" if it has and no address was found.  N.B. Only access this though
    /// get_remote_host()
    pub remote_host: *mut ::libc::c_char,
    /// Only ever set if doing rfc1413 lookups.  N.B. Only access this through
    /// get_remote_logname()
    pub remote_logname: *mut ::libc::c_char,
    /// server IP address
    pub local_ip: *mut ::libc::c_char,
    /// used for ap_get_server_name when UseCanonicalName is set to DNS
    /// (ignores setting of HostnameLookups)
    pub local_host: *mut ::libc::c_char,
    /// ID of this connection; unique at any point in time
    pub id: ::libc::c_long,
    /// Config vector containing pointers to connections per-server
    /// config structures.
    pub conn_config: *mut ffi::ap_conf_vector_t,
    /// Notes on *this* connection: send note from one module to
    /// another. must remain valid for all requests on this conn
    pub notes: *mut ffi::apr_table_t,
    /// A list of input filters to be used for this connection
    pub input_filters: *mut ffi::ap_filter_t,
    /// A list of output filters to be used for this connection
    pub output_filters: *mut ffi::ap_filter_t,
    /// handle to scoreboard information for this connection
    pub sbh: *mut ::libc::c_void,
    /// The bucket allocator to use for all bucket/brigade creations
    pub bucket_alloc: *mut ffi::apr_bucket_alloc_t,
    /// The current state of this connection; may be NULL if not used by MPM
    pub cs: *mut conn_state_t,
    /// Is there data pending in the input filters?
    pub data_in_input_filters: ::libc::c_int,
    /// Is there data pending in the output filters?
    pub data_in_output_filters: ::libc::c_int,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    /// Are we still talking?
    pub aborted: ::libc::c_uint,
    /// Are we going to keep the connection alive for another request?
    /// @see ap_conn_keepalive_e
    pub keepalive: ap_conn_keepalive_e,
    /// How many times have we used it?
    pub keepalives: ::libc::c_int,
    /// Optional connection log level configuration. May point to a server or
    /// per_dir config, i.e. must be copied before modifying
    pub log: *const ap_logconf,
    /// Id to identify this connection in error log. Set when the first
    /// error log entry for this connection is generated.
    pub log_id: *const ::libc::c_char,
    pub current_thread: *mut ffi::apr_thread_t,
}

#[test]
fn bindgen_test_layout_conn_rec() {
    assert_eq!(::std::mem::size_of::<conn_rec>(), 192usize, concat!( "Size of: " , stringify ! ( conn_rec ) ));
    assert_eq!(::std::mem::align_of::<conn_rec>(), 8usize, concat!( "Alignment of " , stringify ! ( conn_rec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).pool as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( pool ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).base_server as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( base_server ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).vhost_lookup_data as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( vhost_lookup_data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).local_addr as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( local_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).client_addr as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( client_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).client_ip as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( client_ip ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).remote_host as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( remote_host ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).remote_logname as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( remote_logname ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).local_ip as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( local_ip ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).local_host as *const _ as usize }, 72usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( local_host ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).id as *const _ as usize }, 80usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( id ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).conn_config as *const _ as usize }, 88usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( conn_config ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).notes as *const _ as usize }, 96usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( notes ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).input_filters as *const _ as usize }, 104usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( input_filters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).output_filters as *const _ as usize }, 112usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( output_filters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).sbh as *const _ as usize }, 120usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( sbh ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).bucket_alloc as *const _ as usize }, 128usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( bucket_alloc ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).cs as *const _ as usize }, 136usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( cs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).data_in_input_filters as *const _ as usize }, 144usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( data_in_input_filters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).data_in_output_filters as *const _ as usize }, 148usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( data_in_output_filters ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).aborted as *const _ as usize }, 156usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( aborted ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).keepalive as *const _ as usize }, 160usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( keepalive ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).keepalives as *const _ as usize }, 164usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( keepalives ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).log as *const _ as usize }, 168usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( log ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).log_id as *const _ as usize }, 176usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( log_id ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_rec>())).current_thread as *const _ as usize }, 184usize, concat!( "Offset of field: " , stringify ! ( conn_rec ) , "::" , stringify ! ( current_thread ) ));
}

impl conn_rec {
    #[inline]
    pub fn clogging_input_filters(&self) -> ::libc::c_uint { unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) } }
    #[inline]
    pub fn set_clogging_input_filters(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn double_reverse(&self) -> ::libc::c_int { unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u32) } }
    #[inline]
    pub fn set_double_reverse(&mut self, val: ::libc::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(clogging_input_filters: ::libc::c_uint, double_reverse: ::libc::c_int) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let clogging_input_filters: u32 = unsafe { ::std::mem::transmute(clogging_input_filters) };
            clogging_input_filters as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let double_reverse: u32 = unsafe { ::std::mem::transmute(double_reverse) };
            double_reverse as u64
        });
        __bindgen_bitfield_unit
    }
}

pub const conn_state_e_CONN_STATE_CHECK_REQUEST_LINE_READABLE: conn_state_e = 0;
pub const conn_state_e_CONN_STATE_READ_REQUEST_LINE: conn_state_e = 1;
pub const conn_state_e_CONN_STATE_HANDLER: conn_state_e = 2;
pub const conn_state_e_CONN_STATE_WRITE_COMPLETION: conn_state_e = 3;
pub const conn_state_e_CONN_STATE_SUSPENDED: conn_state_e = 4;
pub const conn_state_e_CONN_STATE_LINGER: conn_state_e = 5;
pub const conn_state_e_CONN_STATE_LINGER_NORMAL: conn_state_e = 6;
pub const conn_state_e_CONN_STATE_LINGER_SHORT: conn_state_e = 7;

/// Enumeration of connection states
/// The two states CONN_STATE_LINGER_NORMAL and CONN_STATE_LINGER_SHORT may
/// only be set by the MPM. Use CONN_STATE_LINGER outside of the MPM.
pub type conn_state_e = u32;

pub const conn_sense_e_CONN_SENSE_DEFAULT: conn_sense_e = 0;
pub const conn_sense_e_CONN_SENSE_WANT_READ: conn_sense_e = 1;
pub const conn_sense_e_CONN_SENSE_WANT_WRITE: conn_sense_e = 2;

pub type conn_sense_e = u32;

/// @brief A structure to contain connection state information
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct conn_state_t {
    /// Current state of the connection
    pub state: conn_state_e,
    /// Whether to read instead of write, or write instead of read
    pub sense: conn_sense_e,
}

#[test]
fn bindgen_test_layout_conn_state_t() {
    assert_eq!(::std::mem::size_of::<conn_state_t>(), 8usize, concat!( "Size of: " , stringify ! ( conn_state_t ) ));
    assert_eq!(::std::mem::align_of::<conn_state_t>(), 4usize, concat!( "Alignment of " , stringify ! ( conn_state_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_state_t>())).state as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( conn_state_t ) , "::" , stringify ! ( state ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<conn_state_t>())).sense as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( conn_state_t ) , "::" , stringify ! ( sense ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct server_addr_rec {
    /// The next server in the list
    pub next: *mut server_addr_rec,
    /// The name given in "<VirtualHost>"
    pub virthost: *mut ::libc::c_char,
    /// The bound address, for this server
    pub host_addr: *mut apr_sockaddr_t,
    /// The bound port, for this server
    pub host_port: apr_port_t,
}

#[test]
fn bindgen_test_layout_server_addr_rec() {
    assert_eq!(::std::mem::size_of::<server_addr_rec>(), 32usize, concat!( "Size of: " , stringify ! ( server_addr_rec ) ));
    assert_eq!(::std::mem::align_of::<server_addr_rec>(), 8usize, concat!( "Alignment of " , stringify ! ( server_addr_rec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_addr_rec>())).next as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( server_addr_rec ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_addr_rec>())).virthost as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( server_addr_rec ) , "::" , stringify ! ( virthost ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_addr_rec>())).host_addr as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( server_addr_rec ) , "::" , stringify ! ( host_addr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_addr_rec>())).host_port as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( server_addr_rec ) , "::" , stringify ! ( host_port ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_logconf {
    /// The per-module log levels
    pub module_levels: *mut ::libc::c_schar,
    /// The log level for this server
    pub level: ::libc::c_int,
}

#[test]
fn bindgen_test_layout_ap_logconf() {
    assert_eq!(::std::mem::size_of::<ap_logconf>(), 16usize, concat!( "Size of: " , stringify ! ( ap_logconf ) ));
    assert_eq!(::std::mem::align_of::<ap_logconf>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_logconf ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_logconf>())).module_levels as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_logconf ) , "::" , stringify ! ( module_levels ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_logconf>())).level as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_logconf ) , "::" , stringify ! ( level ) ));
}

/// @brief A structure to store information for each virtual server
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct server_rec {
    /// The process this server is running in
    pub process: *mut process_rec,
    /// The next server in the list
    pub next: *mut server_rec,
    /// The name of the error log
    pub error_fname: *mut ::libc::c_char,
    /// A file descriptor that references the error log
    pub error_log: *mut apr_file_t,
    /// The log level configuration
    pub log: ap_logconf,
    /// Config vector containing pointers to modules' per-server config
    /// structures.
    pub module_config: *mut ap_conf_vector_t,
    /// MIME type info, etc., before we start checking per-directory info
    pub lookup_defaults: *mut ap_conf_vector_t,
    /// The name of the server
    pub defn_name: *const ::libc::c_char,
    /// The line of the config file that the server was defined on
    pub defn_line_number: ::libc::c_uint,
    /// true if this is the virtual server
    pub is_virtual: ::libc::c_char,
    /// for redirects, etc.
    pub port: apr_port_t,
    /// The server request scheme for redirect responses
    pub server_scheme: *const ::libc::c_char,
    /// The admin's contact information
    pub server_admin: *mut ::libc::c_char,
    /// The server hostname
    pub server_hostname: *mut ::libc::c_char,
    /// I haven't got a clue
    pub addrs: *mut server_addr_rec,
    /// Timeout, as an apr interval, before we give up
    pub timeout: apr_interval_time_t,
    /// The apr interval we will wait for another request
    pub keep_alive_timeout: apr_interval_time_t,
    /// Maximum requests per connection
    pub keep_alive_max: ::libc::c_int,
    /// Use persistent connections?
    pub keep_alive: ::libc::c_int,
    /// Normal names for ServerAlias servers
    pub names: *mut apr_array_header_t,
    /// Wildcarded names for ServerAlias servers
    pub wild_names: *mut apr_array_header_t,
    /// Pathname for ServerPath
    pub path: *const ::libc::c_char,
    /// Length of path
    pub pathlen: ::libc::c_int,
    /// limit on size of the HTTP request line
    pub limit_req_line: ::libc::c_int,
    /// limit on size of any request header field
    pub limit_req_fieldsize: ::libc::c_int,
    /// limit on number of request header fields
    pub limit_req_fields: ::libc::c_int,
    /// Opaque storage location
    pub context: *mut ::libc::c_void,
}

#[test]
fn bindgen_test_layout_server_rec() {
    assert_eq!(::std::mem::size_of::<server_rec>(), 184usize, concat!( "Size of: " , stringify ! ( server_rec ) ));
    assert_eq!(::std::mem::align_of::<server_rec>(), 8usize, concat!( "Alignment of " , stringify ! ( server_rec ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).process as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( process ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).next as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).error_fname as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( error_fname ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).error_log as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( error_log ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).log as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( log ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).module_config as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( module_config ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).lookup_defaults as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( lookup_defaults ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).defn_name as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( defn_name ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).defn_line_number as *const _ as usize }, 72usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( defn_line_number ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).is_virtual as *const _ as usize }, 76usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( is_virtual ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).port as *const _ as usize }, 78usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( port ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).server_scheme as *const _ as usize }, 80usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( server_scheme ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).server_admin as *const _ as usize }, 88usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( server_admin ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).server_hostname as *const _ as usize }, 96usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( server_hostname ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).addrs as *const _ as usize }, 104usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( addrs ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).timeout as *const _ as usize }, 112usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( timeout ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).keep_alive_timeout as *const _ as usize }, 120usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( keep_alive_timeout ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).keep_alive_max as *const _ as usize }, 128usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( keep_alive_max ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).keep_alive as *const _ as usize }, 132usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( keep_alive ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).names as *const _ as usize }, 136usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( names ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).wild_names as *const _ as usize }, 144usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( wild_names ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).path as *const _ as usize }, 152usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( path ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).pathlen as *const _ as usize }, 160usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( pathlen ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).limit_req_line as *const _ as usize }, 164usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( limit_req_line ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).limit_req_fieldsize as *const _ as usize }, 168usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( limit_req_fieldsize ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).limit_req_fields as *const _ as usize }, 172usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( limit_req_fields ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<server_rec>())).context as *const _ as usize }, 176usize, concat!( "Offset of field: " , stringify ! ( server_rec ) , "::" , stringify ! ( context ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_sload_t { pub idle: ::libc::c_int, pub busy: ::libc::c_int, pub bytes_served: apr_off_t, pub access_count: ::libc::c_ulong }

#[test]
fn bindgen_test_layout_ap_sload_t() {
    assert_eq!(::std::mem::size_of::<ap_sload_t>(), 24usize, concat!( "Size of: " , stringify ! ( ap_sload_t ) ));
    assert_eq!(::std::mem::align_of::<ap_sload_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_sload_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_sload_t>())).idle as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_sload_t ) , "::" , stringify ! ( idle ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_sload_t>())).busy as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ap_sload_t ) , "::" , stringify ! ( busy ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_sload_t>())).bytes_served as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_sload_t ) , "::" , stringify ! ( bytes_served ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_sload_t>())).access_count as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( ap_sload_t ) , "::" , stringify ! ( access_count ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_loadavg_t { pub loadavg: f32, pub loadavg5: f32, pub loadavg15: f32 }

#[test]
fn bindgen_test_layout_ap_loadavg_t() {
    assert_eq!(::std::mem::size_of::<ap_loadavg_t>(), 12usize, concat!( "Size of: " , stringify ! ( ap_loadavg_t ) ));
    assert_eq!(::std::mem::align_of::<ap_loadavg_t>(), 4usize, concat!( "Alignment of " , stringify ! ( ap_loadavg_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_loadavg_t>())).loadavg as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_loadavg_t ) , "::" , stringify ! ( loadavg ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_loadavg_t>())).loadavg5 as *const _ as usize }, 4usize, concat!( "Offset of field: " , stringify ! ( ap_loadavg_t ) , "::" , stringify ! ( loadavg5 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_loadavg_t>())).loadavg15 as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_loadavg_t ) , "::" , stringify ! ( loadavg15 ) ));
}

/// Structure to store the contents of an HTTP form of the type
/// application/x-www-form-urlencoded.
///
/// Currently it contains the name as a char* of maximum length
/// HUGE_STRING_LEN, and a value in the form of a bucket brigade
/// of arbitrary length.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_form_pair_t { pub name: *const ::libc::c_char, pub value: *mut apr_bucket_brigade }

#[test]
fn bindgen_test_layout_ap_form_pair_t() {
    assert_eq!(::std::mem::size_of::<ap_form_pair_t>(), 16usize, concat!( "Size of: " , stringify ! ( ap_form_pair_t ) ));
    assert_eq!(::std::mem::align_of::<ap_form_pair_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_form_pair_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_form_pair_t>())).name as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_form_pair_t ) , "::" , stringify ! ( name ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_form_pair_t>())).value as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_form_pair_t ) , "::" , stringify ! ( value ) ));
}

/// @brief Structure used to build the config tree.
///
/// The config tree only stores
/// the directives that will be active in the running server.  Directives
/// that contain other directions, such as &lt;Directory ...&gt; cause a sub-level
/// to be created, where the included directives are stored.  The closing
/// directive (&lt;/Directory&gt;) is not stored in the tree.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_directive_t {
    /// The current directive
    pub directive: *const ::libc::c_char,
    /// The arguments for the current directive, stored as a space
    /// separated list
    pub args: *const ::libc::c_char,
    /// The next directive node in the tree
    pub next: *mut ap_directive_t,
    /// The first child node of this directive
    pub first_child: *mut ap_directive_t,
    /// The parent node of this directive
    pub parent: *mut ap_directive_t,
    /// directive's module can store add'l data here
    pub data: *mut ::libc::c_void,
    /// The name of the file this directive was found in
    pub filename: *const ::libc::c_char,
    /// The line number the directive was on
    pub line_num: ::libc::c_int,
    /// A short-cut towards the last directive node in the tree.
    /// The value may not always be up-to-date but it always points to
    /// somewhere in the tree, nearer to the tail.
    /// This value is only set in the first node
    pub last: *mut ap_directive_t,
}

#[test]
fn bindgen_test_layout_ap_directive_t() {
    assert_eq!(::std::mem::size_of::<ap_directive_t>(), 72usize, concat!( "Size of: " , stringify ! ( ap_directive_t ) ));
    assert_eq!(::std::mem::align_of::<ap_directive_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_directive_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).directive as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( directive ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).args as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( args ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).next as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( next ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).first_child as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( first_child ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).parent as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( parent ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).data as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).filename as *const _ as usize }, 48usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( filename ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).line_num as *const _ as usize }, 56usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( line_num ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_directive_t>())).last as *const _ as usize }, 64usize, concat!( "Offset of field: " , stringify ! ( ap_directive_t ) , "::" , stringify ! ( last ) ));
}

extern "C" {
    #[link_name = "\u{1}ap_conftree"]
    pub static mut ap_conftree: *mut ap_directive_t;
}

/// < cmd_func parses command line itself
pub const cmd_how_RAW_ARGS: cmd_how = 0;
/// < one argument only
pub const cmd_how_TAKE1: cmd_how = 1;
/// < two arguments only
pub const cmd_how_TAKE2: cmd_how = 2;
/// < one argument, occuring multiple times
/// (e.g., IndexIgnore)
pub const cmd_how_ITERATE: cmd_how = 3;
/// < two arguments, 2nd occurs multiple times
/// (e.g., AddIcon)
pub const cmd_how_ITERATE2: cmd_how = 4;
/// < One of 'On' or 'Off'
pub const cmd_how_FLAG: cmd_how = 5;
/// < No args at all, e.g. &lt;/Directory&gt;
pub const cmd_how_NO_ARGS: cmd_how = 6;
/// < one or two arguments
pub const cmd_how_TAKE12: cmd_how = 7;
/// < three arguments only
pub const cmd_how_TAKE3: cmd_how = 8;
/// < two or three arguments
pub const cmd_how_TAKE23: cmd_how = 9;
/// < one, two or three arguments
pub const cmd_how_TAKE123: cmd_how = 10;
/// < one or three arguments
pub const cmd_how_TAKE13: cmd_how = 11;
/// < an argc and argv are passed
pub const cmd_how_TAKE_ARGV: cmd_how = 12;

/// How the directives arguments should be parsed.
/// @remark Note that for all of these except RAW_ARGS, the config routine is
/// passed a freshly allocated string which can be modified or stored
/// or whatever...
pub type cmd_how = u32;
/// This structure is passed to a command which is being invoked,
/// to carry a large variety of miscellaneous data which is all of
/// use to *somebody*...
pub type cmd_parms = cmd_parms_struct;

/// All the types of functions that can be used in directives
/// @internal
#[repr(C)]
#[derive(Copy, Clone)]
pub union cmd_func {
    /// function to call for a no-args
    pub no_args: ::std::option::Option<unsafe extern "C" fn(parms: *mut cmd_parms, mconfig: *mut ::libc::c_void) -> *const ::libc::c_char>,
    /// function to call for a raw-args
    pub raw_args: ::std::option::Option<unsafe extern "C" fn(parms: *mut cmd_parms, mconfig: *mut ::libc::c_void, args: *const ::libc::c_char) -> *const ::libc::c_char>,
    /// function to call for a argv/argc
    pub take_argv: ::std::option::Option<unsafe extern "C" fn(parms: *mut cmd_parms, mconfig: *mut ::libc::c_void, argc: ::libc::c_int, argv: *const *const ::libc::c_char) -> *const ::libc::c_char>,
    /// function to call for a take1
    pub take1: ::std::option::Option<unsafe extern "C" fn(parms: *mut cmd_parms, mconfig: *mut ::libc::c_void, w: *const ::libc::c_char) -> *const ::libc::c_char>,
    /// function to call for a take2
    pub take2: ::std::option::Option<unsafe extern "C" fn(parms: *mut cmd_parms, mconfig: *mut ::libc::c_void, w: *const ::libc::c_char, w2: *const ::libc::c_char) -> *const ::libc::c_char>,
    /// function to call for a take3
    pub take3: ::std::option::Option<unsafe extern "C" fn(parms: *mut cmd_parms, mconfig: *mut ::libc::c_void, w: *const ::libc::c_char, w2: *const ::libc::c_char, w3: *const ::libc::c_char) -> *const ::libc::c_char>,
    /// function to call for a flag
    pub flag: ::std::option::Option<unsafe extern "C" fn(parms: *mut cmd_parms, mconfig: *mut ::libc::c_void, on: ::libc::c_int) -> *const ::libc::c_char>,
    _bindgen_union_align: u64,
}

#[test]
fn bindgen_test_layout_cmd_func() {
    assert_eq!(::std::mem::size_of::<cmd_func>(), 8usize, concat!( "Size of: " , stringify ! ( cmd_func ) ));
    assert_eq!(::std::mem::align_of::<cmd_func>(), 8usize, concat!( "Alignment of " , stringify ! ( cmd_func ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<cmd_func>())).no_args as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( cmd_func ) , "::" , stringify ! ( no_args ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<cmd_func>())).raw_args as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( cmd_func ) , "::" , stringify ! ( raw_args ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<cmd_func>())).take_argv as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( cmd_func ) , "::" , stringify ! ( take_argv ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<cmd_func>())).take1 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( cmd_func ) , "::" , stringify ! ( take1 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<cmd_func>())).take2 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( cmd_func ) , "::" , stringify ! ( take2 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<cmd_func>())).take3 as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( cmd_func ) , "::" , stringify ! ( take3 ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<cmd_func>())).flag as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( cmd_func ) , "::" , stringify ! ( flag ) ));
}

/// The command record structure.  Modules can define a table of these
/// to define the directives it will implement.
pub type command_rec = command_struct;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct command_struct {
    /// Name of this command
    pub name: *const ::libc::c_char,
    /// The function to be called when this directive is parsed
    pub func: cmd_func,
    /// Extra data, for functions which implement multiple commands...
    pub cmd_data: *mut ::libc::c_void,
    /// What overrides need to be allowed to enable this command.
    pub req_override: ::libc::c_int,
    /// What the command expects as arguments
    pub args_how: cmd_how,
    /// 'usage' message, in case of syntax errors
    pub errmsg: *const ::libc::c_char,
}

#[test]
fn bindgen_test_layout_command_struct() {
    assert_eq!(::std::mem::size_of::<command_struct>(), 40usize, concat!( "Size of: " , stringify ! ( command_struct ) ));
    assert_eq!(::std::mem::align_of::<command_struct>(), 8usize, concat!( "Alignment of " , stringify ! ( command_struct ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<command_struct>())).name as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( command_struct ) , "::" , stringify ! ( name ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<command_struct>())).func as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( command_struct ) , "::" , stringify ! ( func ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<command_struct>())).cmd_data as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( command_struct ) , "::" , stringify ! ( cmd_data ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<command_struct>())).req_override as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( command_struct ) , "::" , stringify ! ( req_override ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<command_struct>())).args_how as *const _ as usize }, 28usize, concat!( "Offset of field: " , stringify ! ( command_struct ) , "::" , stringify ! ( args_how ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<command_struct>())).errmsg as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( command_struct ) , "::" , stringify ! ( errmsg ) ));
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ap_configfile_t { pub getch: ::std::option::Option<unsafe extern "C" fn(ch: *mut ::libc::c_char, param: *mut ::libc::c_void) -> apr_status_t>, pub getstr: ::std::option::Option<unsafe extern "C" fn(buf: *mut ::libc::c_void, bufsiz: apr_size_t, param: *mut ::libc::c_void) -> apr_status_t>, pub close: ::std::option::Option<unsafe extern "C" fn(param: *mut ::libc::c_void) -> apr_status_t>, pub param: *mut ::libc::c_void, pub name: *const ::libc::c_char, pub line_number: ::libc::c_uint }

#[test]
fn bindgen_test_layout_ap_configfile_t() {
    assert_eq!(::std::mem::size_of::<ap_configfile_t>(), 48usize, concat!( "Size of: " , stringify ! ( ap_configfile_t ) ));
    assert_eq!(::std::mem::align_of::<ap_configfile_t>(), 8usize, concat!( "Alignment of " , stringify ! ( ap_configfile_t ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_configfile_t>())).getch as *const _ as usize }, 0usize, concat!( "Offset of field: " , stringify ! ( ap_configfile_t ) , "::" , stringify ! ( getch ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_configfile_t>())).getstr as *const _ as usize }, 8usize, concat!( "Offset of field: " , stringify ! ( ap_configfile_t ) , "::" , stringify ! ( getstr ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_configfile_t>())).close as *const _ as usize }, 16usize, concat!( "Offset of field: " , stringify ! ( ap_configfile_t ) , "::" , stringify ! ( close ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_configfile_t>())).param as *const _ as usize }, 24usize, concat!( "Offset of field: " , stringify ! ( ap_configfile_t ) , "::" , stringify ! ( param ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_configfile_t>())).name as *const _ as usize }, 32usize, concat!( "Offset of field: " , stringify ! ( ap_configfile_t ) , "::" , stringify ! ( name ) ));
    assert_eq!(unsafe { &(*(::std::ptr::null::<ap_configfile_t>())).line_number as *const _ as usize }, 40usize, concat!( "Offset of field: " , stringify ! ( ap_configfile_t ) , "::" , stringify ! ( line_number ) ));
}

/// This structure is passed to a command which is being invoked,
/// to carry a large variety of miscellaneous data which is all of
/// use to *somebody*...
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmd_parms_struct {
    /// Argument to command from cmd_table
    pub info: *mut ::libc::c_void,
    /// Which allow-override bits are set
    pub override_: ::libc::c_int,
    /// Which allow-override-opts bits are set
    pub override_opts: ::libc::c_int,
    /// Table of directives allowed per AllowOverrideList
    pub override_list: *mut apr_table_t,
    /// Which methods are &lt;Limit&gt;ed
    pub limited: apr_int64_t,
    /// methods which are limited
    pub limited_xmethods: *mut apr_array_header_t,
    /// methods which are xlimited
    pub xlimited: *mut ap_method_list_t,
    /// Config file structure.
    pub config_file: *mut ap_configfile_t,
    /// the directive specifying this command
    pub directive: *mut ap_directive_t,
    /// Pool to allocate new storage in
